{"id": " housequake", "name": " Housequake", "consensus_translation": "房震", "category": "歌", "alias": "", "group": "", "author": "Prince", "album": "", "date": "1987", "language": "en", "wikipedia": {"pageid": 3732647, "ns": 0, "title": "Sign o' the Times", "extract": "Sign o' the Times (often stylized as Sign \"☮\" the Times) is the ninth studio album by American singer, songwriter, producer, and multi-instrumentalist Prince. It was first released as a double album on March 30, 1987, by Paisley Park Records and Warner Bros. Records. The album is the follow-up to Parade and is Prince's first album following his disbanding of the Revolution. The album's songs were largely recorded during 1986 to 1987 in sessions for releases Prince ultimately aborted: Dream Factory, the pseudonymous Camille, and finally the triple album Crystal Ball. Prince eventually compromised with label executives and shortened the length of the release to a double album, whose music encompasses a varied range of styles, including funk, soul, psychedelic pop, electro, and rock. \nAs with many of Prince's early 1980s albums, Sign o' the Times features extensive use of the Linn LM-1 drum machine on most songs. In addition, many songs on the album feature minimal instrumentation, and use of the Fairlight CMI, a then state-of-the-art digital sampler. Four of the album's standout songs, \"Housequake\", \"Strange Relationship\", \"U Got the Look\" with Sheena Easton, and \"If I Was Your Girlfriend\"  offer sped-up vocals, ostensibly the voice of \"Camille\", Prince's alter ego of the Sign o' the Times era.\nSign o' the Times' release was supported by several singles, among them the socially conscious \"Sign o' the Times\" and \"If I Was Your Girlfriend\"; in addition to a well-received concert film of the same name. Sign o' the Times peaked at number six on the Billboard 200. It reached the top 10 in Austria, France, Italy, New Zealand, Norway, Sweden, and the UK and reached number one in Switzerland. \"Sign o' the Times\", \"U Got the Look\" and \"I Could Never Take the Place of Your Man\" were all top 10 hits on the Billboard Hot 100. Sign o' the Times was certified Platinum by the Recording Industry Association of America (RIAA) four months after its release. Following Prince's death in 2016, the album re-entered the Billboard 200 at number 20.\nThough not as commercially successful as Purple Rain, Sign o' the Times was Prince's most acclaimed record, being voted 1987's best album in the Pazz & Jop critics poll and since being ranked as one of the greatest albums of all time by several publications. It has been regarded by many critics as Prince's best album, ahead of Purple Rain. Writing for The Rolling Stone Album Guide (2004), Michaelangelo Matos regarded it as \"the most complete example of [Prince's] artistry's breadth, and arguably the finest album of the 1980s\". In 2017, Sign o' the Times was inducted into the Grammy Hall of Fame."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "房震", "details": "来自赵老师"}]}