{"id": "a christmas gift for you from phil spector", "name": "A Christmas Gift for You from Phil Spector", "consensus_translation": "菲尔·斯派克特送给你的圣诞礼物", "category": "专辑", "alias": "", "group": "", "author": "Phil Spector", "album": "", "date": "1963", "language": "en", "wikipedia": {"pageid": 3937571, "ns": 0, "title": "A Christmas Gift for You from Phil Spector", "extract": "A Christmas Gift for You from Phil Spector (originally released as A Christmas Gift for You from Philles Records) is an album of Christmas songs, produced by Phil Spector, and originally released as Philles 45 in 1963. Spector treated a series of mostly secular Christmas standards to his \"Wall of Sound\" treatment, and the selections feature the vocal performances of Spector's regular artists during this period. The album peaked at No. 13 on Billboard magazine's special, year-end, weekly Christmas Albums sales chart in December 1963.The album was reissued by Apple Records in 1972, with different cover art—a photograph of Spector dressed as a heavily bearded Santa Claus, wearing a \"Back to Mono\" button—and retitled Phil Spector's Christmas Album.  This version of the album went to No. 6 on Billboard's special Christmas Albums sales chart in December of that year, which was its highest chart ranking. It was also in 1972 that the album made its debut on the UK Albums Chart; it would re-chart in 1983, peaking at No. 19. On the week ending December 15, 2018, A Christmas Gift for You from Phil Spector entered the main Billboard 200 albums chart for the first time (at position No. 48), eventually peaking at No. 12 three weeks later (on the week ending January 5, 2019).In 2003, the album was voted No. 142 on Rolling Stone magazine's list of the 500 greatest albums of all time, maintaining the rating in a 2012 revised list. In 2017, it was ranked the 130th greatest album of the 1960s by Pitchfork. Brian Wilson of the Beach Boys has cited this album as his favorite of all time. The album was included in Robert Dimery's 1001 Albums You Must Hear Before You Die."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "菲尔·斯派克特送给你的圣诞礼物", "details": ""}]}