{"id": "a tribe called quest", "name": "A Tribe Called Quest", "consensus_translation": "探索一族", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 147462, "ns": 0, "title": "A Tribe Called Quest", "extract": "A Tribe Called Quest was an American hip hop group formed in St. Albans, Queens, New York in 1985, originally composed of rapper and main producer Q-Tip, rapper Phife Dawg, DJ and co-producer Ali Shaheed Muhammad, and rapper Jarobi White, who left the group amicably in 1991. Later that year, the group released its jazz-influenced second album, The Low End Theory, regarded for helping shape alternative hip hop in the 1990s. In 1998, the group broke up shortly before releasing its fifth album, The Love Movement, but in 2006, the group's original members reunited and toured the United States. In 2016, the group released its sixth and final album, We Got It from Here... Thank You 4 Your Service, which was still incomplete when Phife Dawg died suddenly in March 2016, and was completed by the other members after his death. A Tribe Called Quest was the most commercially successful act in the Native Tongues collective, with all six of its albums certified either gold or platinum.The group is regarded as a pioneer of alternative hip hop music. John Bush of AllMusic called them \"the most intelligent, artistic rap group during the 1990s.\" The Source gave the group's debut album, People's Instinctive Travels and the Paths of Rhythm (1990), a perfect rating of five 'mics,' marking the first time that the magazine awarded the rating. In 2005, A Tribe Called Quest received the Founders Award at the Billboard R&B/Hip-Hop Awards. In 2007, the group was honored at the 4th VH1 Hip Hop Honors."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "探索一族", "details": "台译：http://www.willmusic.com.tw/SalePage/Index/5349680?cid=290199"}, {"user_name": "Tian Tang", "github_handle": "Tian-Tang", "translation": "探索一族", "details": "Originally the group was just called Quest. After meeting the Jungle Brothers, Afrika Baby Bam heard Q-Tip introduce himself on a demo track as being \"from a group called Quest\" and told him to say he was from \"a tribe called Quest\" and the name stuck."}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "探索一族", "details": "台译很贴切了，就照着用。如果加注释的话可以说一下缘起：最早他们几个人取的乐团名只是一个单词quest。在制作【black is black】这首单曲时，前来造访的朋友提议在quest前面加上a tribe called，正好完美无缺。"}]}