{"id": "aerosmith", "name": "Aerosmith", "consensus_translation": "空中铁匠", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 149216, "ns": 0, "title": "Aerosmith", "extract": "Aerosmith is an American rock band formed in Boston, Massachusetts in 1970. The group consists of Steven Tyler (lead vocals), Joe Perry (guitar, vocals), Tom Hamilton (bass), Joey Kramer (drums) and Brad Whitford (guitar). Their style, which is rooted in blues-based hard rock, has come to also incorporate elements of pop rock, heavy metal, and rhythm and blues, and has inspired many subsequent rock artists. They are sometimes referred to as \"the Bad Boys from Boston\" and \"America's Greatest Rock and Roll Band\".  As a partnership, the primary songwriting team of Tyler and Perry is often collectively known as the \"Toxic Twins\".\nPerry and Hamilton, originally in a band together called the Jam Band, met up with Tyler, Kramer, and guitarist Ray Tabano, and formed Aerosmith. In 1971, Tabano was replaced by Whitford, and the band began developing a following in Boston. They were signed to Columbia Records in 1972, and released a string of gold and platinum albums, beginning with their 1973 eponymous debut album, followed by Get Your Wings in 1974. In 1975, the band broke into the mainstream with the album Toys in the Attic, and their 1976 follow-up Rocks cemented their status as hard rock superstars. Draw the Line and Night in the Ruts followed in 1977 and 1979 respectively. Their first five albums have since attained multi-platinum status. Throughout the 1970s, the band toured extensively and charted a dozen Billboard Hot 100 singles, including their first Top 40 hit \"Sweet Emotion\" and the Top 10 hits \"Dream On\" and \"Walk This Way\". By the end of the decade, they were among the most popular hard rock bands in the world and developed a following of fans, often referred to as the \"Blue Army\". Drug addiction and internal conflict took their toll on the band, which led to the departures of Perry and Whitford in 1979 and 1981, respectively; they were replaced by Jimmy Crespo and Rick Dufay.\nThe band did not fare well between 1980 and 1984, releasing the album Rock in a Hard Place, which was certified gold but failed to match their previous successes.\nPerry and Whitford returned to Aerosmith in 1984 and the band signed a new deal with Geffen Records. After a comeback tour, the band recorded Done with Mirrors (1985), which won some critical praise but failed to match commercial expectations. It was not until the band's collaboration with rap group Run–D.M.C. in 1986, and the 1987 multi-platinum release, Permanent Vacation, that they regained the level of popularity they had experienced in the 1970s. In the late 1980s and 1990s, the band scored several Top 40 hits and won numerous awards for music from the multi-platinum albums Pump (1989), Get a Grip (1993), and Nine Lives (1997), while they embarked on their most extensive concert tours to date. Their biggest hit singles (all of which reached the Top 20) during this time included \"Dude (Looks Like a Lady)\", \"Angel\", \"Rag Doll\", \"Love in an Elevator\", \"Janie's Got a Gun\", \"What it Takes\", \"Livin' on the Edge\", \"Cryin'\", and \"Crazy\". The band also became a pop culture phenomenon with popular music videos and notable appearances in television, film, and video games. In 1998, they achieved their first number-one hit with \"I Don't Want to Miss a Thing\" from Armageddon's soundtrack and the following year, their own roller coaster attraction opened at Walt Disney World. Their comeback has been described as one of the most remarkable and spectacular in rock history. Additional albums Just Push Play (which included the Top 10 hit \"Jaded\"), Honkin' on Bobo (a collection of blues covers), and Music from Another Dimension! followed in 2001, 2004, and 2012 respectively, and in 2008, they released Guitar Hero: Aerosmith, which is considered to be the best-selling band-centric video game. After 50 years of performing, the band continues to tour and record music, but is embarking on a farewell tour that will likely last several years. The band has an ongoing concert residency in Las Vegas that will last through mid 2020.\nAerosmith is the best-selling American hard rock band of all time, having sold more than 150 million records worldwide, including over 70 million records in the United States alone. With 25 gold albums, 18 platinum albums, and 12 multi-platinum albums, they hold the record for the most total certifications by an American band and are tied for the most multi-platinum albums by an American band. The band has scored twenty-one Top 40 hits on the Billboard Hot 100, nine number-one Mainstream Rock hits, four Grammy Awards, six American Music Awards, and ten MTV Video Music Awards. They were inducted into the Rock and Roll Hall of Fame in 2001, and were included among both Rolling Stone's and VH1's lists of the 100 Greatest Artists of All Time at number 57 and number 30 respectively. In 2013, the band's principal songwriters, Tyler and Perry, were inducted into the Songwriters Hall of Fame, and in 2020, the band received the MusiCares Person of the Year award."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "空中铁匠", "details": ""}]}