{"id": "aphex twin", "name": "Aphex Twin", "consensus_translation": "艾菲克斯双胞胎", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 18949200, "ns": 0, "title": "Aphex Twin", "extract": "Richard David James (born 18 August 1971), best known by the stage name Aphex Twin, is an English musician. He is best known for his idiosyncratic work in electronic styles such as techno and ambient music in the 1990s, and has also been associated with the electronic subgenre known as  intelligent dance music. In 2001, Guardian journalist Paul Lester called James \"the most inventive and influential figure in contemporary electronic music\".Raised in Cornwall, James began performing as a rave DJ at local clubs and free parties in the late 1980s. In 1991 his debut EP Analogue Bubblebath was released on Mighty Force, a local independent label, winning him acclaim and a cult following. James co-founded the independent label Rephlex Records the same year. He attracted wider praise for his 1992 debut album Selected Ambient Works 85–92, released by Belgian label Apollo. He signed to the UK label Warp in 1993, and his music became increasingly well known with the charting albums Selected Ambient Works Volume II (1994) and ...I Care Because You Do (1995), and singles \"On\" (1993), \"Come to Daddy\" (1997), and \"Windowlicker\" (1999). The latter two singles, accompanied by music videos directed by Chris Cunningham, brought James attention in the US market.\nJames has also recorded under aliases including AFX, Caustic Window, and Polygon Window. After releasing the Aphex Twin album Drukqs in 2001, James spent the following years releasing music mostly under other aliases, including the 2005 Analord EP series as AFX, a pair of 2007 releases as the Tuss, and archival material such as an unreleased 1994 LP in 2014 as Caustic Window. He returned as Aphex Twin in 2014 with the album Syro, which won the Grammy Award for Best Dance/Electronic Album. He has since released further charting EPs, including Cheetah (2016) and Collapse (2018).\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "艾菲克斯双胞胎", "details": ""}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "艾菲克斯双胞胎", "details": "这随便音译，不要深究，直到目前为止都没有常用的中文译名，因为连aphex的英文发音都没有统一。"}]}