{"id": "arrested development", "name": "Arrested Development", "consensus_translation": "发展受阻", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 496020, "ns": 0, "title": "Arrested Development", "extract": "Arrested Development is an American television sitcom created by Mitchell Hurwitz, which originally aired on Fox for three seasons from November 2, 2003, to February 10, 2006. The show follows the Bluths, a formerly wealthy dysfunctional family. It is presented in a serialized format, incorporating handheld camera work, voice-over narration,  archival photos, and historical footage. The show also maintains numerous running gags and catchphrases. Ron Howard serves as both an executive producer and the omniscient narrator and, in later seasons, appears in the show portraying a fictionalized version of himself. Set in Newport Beach, California, Arrested Development was filmed primarily in Culver City and Marina del Rey.The series received critical acclaim, six Primetime Emmy Awards, and one Golden Globe Award, and attracted a cult following. It has been named one of the greatest TV shows by publications including Time, Entertainment Weekly, and IGN. It influenced later single-camera comedy series such as 30 Rock and Community.Despite the positive response from critics, Arrested Development received low ratings and viewership on Fox, which canceled the series in 2006. In 2011, Netflix agreed to license new episodes and distribute them exclusively on its video streaming service. These episodes were released in May 2013. Netflix commissioned a fifth season of Arrested Development, the first half of which premiered on May 29, 2018, and the second half on March 15, 2019."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "发展受阻", "details": ""}, {"user_name": "Tian Tang", "github_handle": "Tian-Tang", "translation": "发展受阻", "details": ""}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "发展受阻", "details": "这个词组好像因为同名电视剧都翻成了发展受阻，差不多也算是约定俗成了。问了下朋友，之前有个中文翻译叫：抑制成长"}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "揠苗助长合唱团", "details": "揠苗助长合唱团（台湾人翻的 不错）"}]}