{"id": "b.o.b", "name": "B.o.B", "consensus_translation": "B.o.B", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 20116909, "ns": 0, "title": "B.o.B.", "extract": "Bobby Ray Simmons Jr. (born November 15, 1988), better known by his stage name B.o.B, is an American rapper, singer, songwriter, record producer and conspiracy theorist from Decatur, Georgia. In 2006, B.o.B was discovered by Brian Richardson, who then introduced him to TJ Chapman, who subsequently brought him to American record producer Jim Jonsin. After hearing his music, Jonsin signed B.o.B to his Rebel Rock Entertainment imprint. Two years later, Jonsin and B.o.B signed a joint venture deal, with Atlantic Records and American rapper T.I.'s Grand Hustle Records.B.o.B quickly rose to fame after his commercial debut single \"Nothin' on You\", reached number one in both the United States and the United Kingdom. He would later release his third single \"Airplanes\", which also topped several major music charts. His fifth single \"Magic\", became his 3rd top 10 hit on the US Billboard Hot 100. B.o.B's debut studio album The Adventures of Bobby Ray, which was preceded by two extended plays (EPs) and several mixtapes, was released in April 2010. The album reached number one on the US Billboard 200 and was eventually certified 2× platinum by the Recording Industry Association of America (RIAA) in 2016. B.o.B was named the ninth \"Hottest MC in the Game of 2010\" by MTV, on their annual list.B.o.B released his second studio album Strange Clouds, in May 2012. The album spawned six singles, four of which charted exceptionally well internationally. The album's eponymous lead single became his fourth top 10 hit on the Billboard Hot 100. The singles \"So Good\", \"Both of Us\" and \"Out of My Mind\", followed behind, with the former two being certified platinum by the RIAA. The album itself debuted at number five on the Billboard 200. His third album Underground Luxury, was released in December 2013 and supported by the lead single \"HeadBand\". In August 2015, B.o.B unexpectedly released a new project Psycadelik Thoughtz, via digital distribution, with little-to-no promotion. B.o.B is an outspoken believer that the earth is flat."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "B.o.B", "details": ""}]}