{"id": "beastie boys", "name": "Beastie Boys", "consensus_translation": "小兽孩", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 3735, "ns": 0, "title": "Beastie Boys", "extract": "Beastie Boys were an American hip hop group from New York City formed in 1978. The group was composed of Michael \"Mike D\" Diamond (vocals, drums), Adam \"MCA\" Yauch (vocals, bass) and Adam \"Ad-Rock\" Horovitz (vocals, guitar, programming).\nBeastie Boys were formed out of members of experimental hardcore punk band the Young Aborigines in 1978, with Diamond as vocalist, Jeremy Shatan on bass guitar, guitarist John Berry and Kate Schellenbach on drums. When Shatan left in 1981, Yauch replaced him on bass and the band changed their name to Beastie Boys. Berry left shortly thereafter and was replaced by Horovitz.\nAfter achieving local success with the 1983 experimental hip hop single \"Cooky Puss\", Beastie Boys made a full transition to hip hop, and Schellenbach left. They toured with Madonna in 1985 and a year later released their debut album, Licensed to Ill, the first rap record to top the Billboard 200 chart. Their second album, Paul's Boutique (1989), was a commercial failure, but later received acclaim. Check Your Head (1992) and Ill Communication (1994) found mainstream success, followed by Hello Nasty (1998), To the 5 Boroughs (2004), The Mix-Up (2007), and Hot Sauce Committee Part Two (2011).\nBeastie Boys have sold 20 million records in the United States, making them the biggest-selling rap group since Billboard began recording sales in 1991. With seven platinum-selling albums from 1986 to 2004, Beastie Boys were one of the longest-lived hip hop acts worldwide. In 2012, they became the third rap group to be inducted into the Rock and Roll Hall of Fame. In the same year, Yauch died of cancer and Beastie Boys disbanded.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "小兽孩", "details": "野兽男孩"}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "兽孩儿", "details": ""}]}