{"id": "big chief", "name": "Big Chief", "consensus_translation": "大人物", "category": "歌", "alias": "", "group": "", "author": "Professor Longhair", "album": "", "date": "1964", "language": "en", "wikipedia": {"pageid": 13029074, "ns": 0, "title": "Big Chief", "extract": "\"Big Chief\" is a song composed by Earl King in the early 1960s. It became a hit in New Orleans for Professor Longhair in 1964, featuring a whistled first chorus in a rollicking blues piano style and subsequent lyrics written in mock-American-Indian pidgin (whistled and sung by King, uncredited). The tune became popular in New Orleans, frequently performed by local musicians such as Dr. John, and is now a staple of the repertory of most brass bands and musicians in the area.  (Even though it was not a national hit, the single was available for years in the New Orleans area, especially during Mardi Gras.)\nKing wrote the song while attending school, and recalled the tune during a recording session with Longhair arranged by Wardell Quezergue. Longhair originally wanted to record the song with a small ensemble, but Quezergue, King, and Smokey Johnson (who also played on the session) convinced him to include an eleven- or fifteen-piece horn ensemble on the 1964 recording.The song refers to Mardi Gras Indian groups; an important part of the African American Mardi Gras tradition.   The \"Indian Nation\" of Mardi Gras Indian \"gangs\" in New Orleans includes the Wild Magnolias, the Golden Eagles, and several others. Mardi Gras Indian gangs have existed since the early 20th Century. Each gang performs its own original songs and dances on Mardi Gras Day, on \"Super Sunday\" (the Sunday before St. Patrick's Day) and at other functions in the community.  The \"Big Chief\", the \"Spy Boy\", the \"Flag Boy\" and several other roles or offices are important to the Mardi Gras Indian tradition of \"masking\" (parading through the street in full costume). These characters are mentioned in Earl King's song, as well as many other songs which have come out of New Orleans.According to tradition, the African Americans in New Orleans who first formed \"Indian gangs\" did so as a tribute to the Native American tribes in the area who took in runaway slaves in the pre-Civil War era. Mardi Gras Indians wear elaborate, hand made costumes which feature massive feather headdresses and intricate bead work.\nThe song is sampled in the song \"Knock 'Em Out\" from Alright, Still, the debut album from Lily Allen."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "大人物", "details": ""}]}