{"id": "biggie", "name": "Biggie", "consensus_translation": "大个子", "category": "乐人", "alias": "Notorious B.I.G.", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 142510, "ns": 0, "title": "The Notorious B.I.G.", "extract": "Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names The Notorious B.I.G., Biggie Smalls, or simply Biggie, was an American rapper and songwriter. Rooted in the New York rap scene and gangsta rap traditions, he is considered one of the greatest rappers of all time. The Notorious B.I.G. became known for his distinctive laidback lyrical delivery, offsetting the lyrics' often grim content and his own intimidating appearance. His music was often semi-autobiographical, telling of hardship and criminality, but also of debauchery and celebration.Born and raised in Brooklyn, New York City, The Notorious B.I.G. signed to Sean \"Puffy\" Combs' label Bad Boy Records as it launched in 1993, and gained exposure through features on several, other artists' singles that year. His debut album Ready to Die (1994) was met with widespread critical acclaim, and produced his signature songs \"Juicy\" and \"Big Poppa\". The album made him the central figure in East Coast hip hop, and restored New York's visibility at a time when the West Coast hip hop scene was dominating hip hop music. The Notorious B.I.G. was awarded the 1995 Billboard Music Awards' Rapper of the Year. The following year, he led his protégé group Junior M.A.F.I.A., a team of himself and longtime friends, including Lil' Kim, to chart success.\nDuring 1996, while recording his second album, The Notorious B.I.G. became ensnarled in the escalating East Coast–West Coast hip hop feud. Following Tupac Shakur's death in a drive-by shooting in Las Vegas in September 1996, speculations of involvement by criminal elements orbiting the Bad Boy circle circulated. On March 9, 1997, while visiting Los Angeles, Wallace was murdered in a drive-by shooting. The assailant remains unidentified. The Notorious B.I.G.'s  sophomore album Life After Death, a double album, was released two weeks later. It reached number one on the Billboard 200, and eventually achieved a Diamond certification in the US.With two more posthumous albums released, The Notorious B.I.G. has accrued certified sales of over 28 million copies in the United States, including 21 million albums. Rolling Stone has called him the \"greatest rapper that ever lived,\" and Billboard named him the greatest rapper of all time. The Source magazine named him the greatest rapper of all time in its 150th issue. In 2006, MTV ranked him at No. 3 on their list of The Greatest MCs of All Time, calling him possibly \"the most skillful ever on the mic\".  In 2020, The Notorious B.I.G. was inducted into the Rock and Roll Hall of Fame.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "大个子", "details": ""}]}