{"id": "black and yellow", "name": "Black and Yellow", "consensus_translation": "黑与黄", "category": "歌", "alias": "", "group": "", "author": "Wiz Khalifa", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 29210709, "ns": 0, "title": "Black and Yellow", "extract": "\"Black and Yellow\" is a song by American rapper Wiz Khalifa from his third studio album, Rolling Papers. It was released on September 14, 2010, as the lead single from the album. The song was written by Khalifa, along with Stargate, who produced it. It was released as a CD single in honor of Record Store Day. The song peaked at number one on the Billboard Hot 100, becoming Wiz Khalifa's first number-one single in the US; he would top the chart again in 2015 with \"See You Again\".\nThe song is about Khalifa's car, a yellow Dodge Challenger Hemi with black stripes. He has stated that he got the car in those colors as a tribute to his hometown of Pittsburgh, Pennsylvania, whose official colors are black and gold, and its professional sports teams, most of whose colors are black and some variation of gold or yellow. The song itself does not mention Pittsburgh or sports, although the song's music video made the connection to Pittsburgh explicit, showing various iconic locations in the city, as well as apparel associated with the football team the Pittsburgh Steelers, the hockey team the Pittsburgh Penguins, and the baseball team the Pittsburgh Pirates. In the year after it was released, \"Black and Yellow\" spawned dozens of remixes, parodies and remakes, both in the US and internationally, many of them made in tribute to a local sports team. At Super Bowl XLV in 2011, which featured the Steelers competing against the Green Bay Packers, the Steelers used \"Black and Yellow\" as their fight song, while the Packers used a remix by Lil' Wayne called \"Green and Yellow\", marking the first time both teams at the Super Bowl had used the same song."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "黑与黄", "details": ""}]}