{"id": "bone thugs-n-harmony", "name": "Bone Thugs-n-Harmony", "consensus_translation": "硬骨柔情帮", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 261059, "ns": 0, "title": "Bone Thugs-n-Harmony", "extract": "Bone Thugs-n-Harmony is an American hip hop group consisting of rappers Bizzy Bone, Wish Bone, Layzie Bone, Krayzie Bone, and Flesh-n-Bone. The group was signed to Ruthless Records in late 1993, when they debuted with their EP Creepin on ah Come Up. The EP included their breakout hit single \"Thuggish Ruggish Bone\".\nIn 1995, the group released its second album, E. 1999 Eternal, which included hits \"1st of tha Month\" and \"East 1999\". Their hit song \"Tha Crossroads\", a tribute to then-recently deceased Eazy-E, won a Grammy Award in 1997. The Art of War, the group's third album, was also released in 1997. Bone Thugs is the only group that has worked with 2Pac, Notorious B.I.G., Eazy-E, and Big Pun while they were still alive. The editors of About.com ranked them #12 on their list of the \"25 Best Rap Groups of All Time\", and MTV called them \"the most melodic hip-hop group of all time.\"In 2000, BTNHResurrection reached platinum in one month, while 2002's Thug World Order received more moderate sales and promotion, going gold and peaking at #3 on the Top R&B/Hip-Hop Albums chart. After that album, the group went on hiatus from their label and released their sixth studio album, Thug Stories, independently in 2006. In 2007 they had another major-label release, Strength & Loyalty, on Swizz Beatz's label Full Surface Records. Bone Thugs-N-Harmony \"officially\" returned with their 2010 album Uni5: The World's Enemy, released by their own record label, BTNH Worldwide, with distribution by Warner Bros.\nDue to conflicts within the group, longtime members Krayzie Bone and Wish Bone officially left the group in April 2011 to work with their independent label, The Life Entertainment. They would later return, officially re-unifying the group. In August 2013, however, Layzie Bone announced that he would be stepping aside to work more on his solo career. In the same month, BTNH signed with eOne Entertainment (formerly known as Koch Records), who they had previously partnered with to release 2006's Thug Stories. Layzie Bone has since re-united with the group, and they toured in 2018.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "骨头恶棍和声", "details": ""}, {"user_name": "Tian Tang", "github_handle": "Tian-Tang", "translation": "硬骨柔情帮", "details": ""}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "骨头帮", "details": ""}]}