{"id": "boyz n the hood", "name": "Boyz n the Hood", "consensus_translation": "街区男孩", "category": "影视剧", "alias": "", "group": "", "author": "", "album": "", "date": 1991.0, "language": "en", "wikipedia": {"pageid": 155997, "ns": 0, "title": "Boyz n the Hood", "extract": "Boyz n the Hood is a 1991 American coming-of-age drama film, written and directed by John Singleton in his feature directorial debut. It stars Ice Cube, Cuba Gooding Jr., Morris Chestnut, Laurence Fishburne, Nia Long, Regina King, and Angela Bassett. Boyz n the Hood follows Tre Styles (Gooding Jr.), who is sent to live with his father Furious Styles (Fishburne) in South Central Los Angeles, surrounded by the neighborhood's booming gang culture.\nSingleton initially developed the film as a requirement for application to film school in 1986, and sold the script to Columbia Pictures upon graduation in 1990. During writing, he drew inspiration from his own life and from the lives of people he knew, and insisted he direct the project. Principal photography began in September 1990, and was filmed on location from October to November 1990. The film is notable for being shot in sequence, and features breakout roles for Ice Cube, Gooding Jr., and Nia Long.\nBoyz n the Hood premiered in Los Angeles on July 2, 1991, and was theatrically released in the United States ten days later. The film became a critical and commercial success, praised for its emotional weight, acting, and writing. It grossed $57.5 million in North America, and was nominated for Best Director and Best Original Screenplay at the 64th Academy Awards, making Singleton the youngest person and the first African-American to be nominated for Best Director.\nThe film was screened in the Un Certain Regard section at the 1991 Cannes Film Festival. In 2002, the United States Library of Congress deemed it \"culturally, historically, or aesthetically significant\" and selected it for preservation in the National Film Registry."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "街区男孩", "details": ""}]}