{"id": "bring the noise", "name": "Bring the Noise", "consensus_translation": "来点噪音", "category": "歌", "alias": "", "group": "", "author": "Public Enemy", "album": "", "date": "1987", "language": "en", "wikipedia": {"pageid": 10529370, "ns": 0, "title": "Bring the Noise", "extract": "\"Bring the Noise\" is a song by the American hip hop group Public Enemy. It was included on the soundtrack of the 1987 film Less Than Zero and was also released as a single that year. It later became the first song on the group's 1988 album It Takes a Nation of Millions to Hold Us Back. The single reached No. 56 on the Billboard Hot R&B/Hip-Hop Songs chart.\nThe song's lyrics, most of which are delivered by Chuck D with interjections from Flavor Flav, include boasts of Public Enemy's prowess, an endorsement of Nation of Islam leader Louis Farrakhan, retorts to unspecified critics, and arguments for rap as a legitimate musical genre on par with rock. The lyrics also have a notable metrical complexity, making extensive use of meters like dactylic hexameter. The title phrase appears in the chorus. The song includes several shout-outs to fellow hip hop artists like Run–D.M.C., Eric B, LL Cool J and, unusually for a rap group, Yoko Ono, Sonny Bono and thrash metal band Anthrax, allegedly because Chuck D was flattered about Scott Ian wearing Public Enemy shirts while performing Anthrax gigs. Anthrax later collaborated with Chuck D to cover the song.\nThe song's production by The Bomb Squad, which exemplifies their characteristic style, features a dissonant mixture of funk samples, drum machine patterns, record scratching by DJ Terminator X, siren sound effects and other industrial noise.\nCritic Robert Christgau has described the song as \"postminimal rap refracted through Blood Ulmer and On the Corner, as gripping as it is abrasive, and the black militant dialogue-as-diatribe that goes with it is almost as scary as \"Stones in My Passway\" or \"Holiday in the Sun\". \"Bring the Noise\" was ranked No. 160 on Rolling Stone's list of the 500 greatest songs of all time.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "来点噪音", "details": ""}]}