{"id": "bruno mars", "name": "Bruno Mars", "consensus_translation": "布鲁诺·马尔斯", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 27005455, "ns": 0, "title": "Bruno Mars", "extract": "Peter Gene Hernandez (born October 8, 1985), known professionally as Bruno Mars, is an American singer, songwriter, record producer, multi-instrumentalist, and dancer. He is known for his stage performances, retro showmanship, and for performing in a wide range of musical styles, including pop, R&B, funk, soul, reggae, hip hop, and rock. Mars is accompanied by his band, The Hooligans, who play a variety of instruments, such as electric guitar, bass, piano, keyboards, drums, and horns, and also serve as backup singers and dancers.\nBorn and raised in Honolulu, Hawaii, Mars moved to Los Angeles in 2003 to pursue a musical career. After being dropped by Motown Records, Mars signed a recording contract with Atlantic Records in 2009. In the same year, he co-founded the production team The Smeezingtons, responsible for various successful singles for Mars himself and other artists. Mars rose to fame in 2010 with the release of the successful singles \"Nothin' on You\" by B.o.B and \"Billionaire\" by Travie McCoy, both of which featured his vocals on the hooks. His debut studio album Doo-Wops & Hooligans (2010) spawned the international number-one singles \"Just the Way You Are\", \"Grenade\", and \"The Lazy Song\". The former won the Grammy Award for Best Male Pop Vocal Performance.\nMars' second album, Unorthodox Jukebox (2012), became his first number one album on the US Billboard 200 and won the Grammy Award for Best Pop Vocal Album. Its singles \"Locked Out of Heaven\" and \"When I Was Your Man\", reached number one on the US Billboard Hot 100 chart. In 2014, Mars collaborated with Mark Ronson on \"Uptown Funk\", which topped many music charts worldwide and won Record of the Year and Best Pop Duo/Group Performance at the 2016 Grammy Awards. In 2016, Mars co-founded the production team Shampoo Press & Curl, who replaced The Smeezingtons on the composition of his third studio album, the R&B-focused, 24K Magic. The record received seven Grammy Awards, winning the major categories of Album of the Year, Record of the Year, and Song of the Year. The album also yielded the successful singles \"24K Magic\", \"That's What I Like\", and \"Finesse\".\nMars has sold over 130 million records worldwide, making him one of the best-selling music artists of all time. He has released seven number-one singles on the Billboard Hot 100 since his career launched in 2010, attaining his first five faster than any male artist since Elvis Presley. As a songwriter, he was included in Music Week and Billboard magazine as one of the best songwriters of 2011 and 2013, respectively. Mars has received several awards and nominations, including 11 Grammy Awards, three Brit Awards, nine American Music Awards, 10 Soul Train Awards and holds three Guinness World Records. He has appeared in Time magazine's list of the 100 most influential people in the world in 2011 and Forbes magazine's lists of '30 under 30' in 2013, and Celebrity 100 in 2014, 2018 and 2019."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "布鲁诺·马尔斯", "details": ""}]}