{"id": "cee-lo", "name": "Cee-Lo", "consensus_translation": "希洛", "category": "乐人", "alias": "", "group": "Goodie Mob/Gnarls Barkley", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 1331074, "ns": 0, "title": "Cee-lo", "extract": "Cee-lo is a gambling game played with three six-sided dice.  There is not one standard set of rules, but there are some constants that hold true to all sets of rules. The name comes from the Chinese Sì-Wŭ-Liù (四五六), meaning \"four-five-six\". In America it is also called \"See-Low,\" \"Four-Five-Six,\" \"The Three Dice Game,\" \"Roll-off!,\" and by several alternative spellings, as well as simply \"Dice.\" In China it is also called \"Sān Liù Bàozi\" (三六豹子), or \"Three-Six Leopards\". In Japan, it is known as \"Chinchiro\" (チンチロ) or \"Chinchirorin\" (チンチロリン).\nThe constants include the number of dice used, which is always three.  All rules describe certain winning combinations that can be rolled, and 4-5-6 is always treated as a winning combination for the first player who rolls it (though in some variants without a banker, it may be possible for several players to make a \"winning combination,\" requiring a second shootout).  Besides the winning combinations, all Cee-lo rules include certain rolls that establish a \"point,\" and there are situations where two or more players will roll and compare their points to determine a winner. If for any reason the dice were to leave the playing area (ex: rolling off of the table and hitting the floor) the player would be deemed an automatic loss.\nThe various sets of rules can be divided into two broad categories according to how betting is handled.  In banking games, one player serves as a banker, who covers the individual bets of the other players, each of whom competes directly with the bank.  In non-banking games, each player has essentially equal status, and rules must exist for the players to pool their bets and attempt to win from a common pot.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "希洛", "details": ""}]}