{"id": "crazysexycool", "name": "CrazySexyCool", "consensus_translation": "疯狂性感酷", "category": "专辑", "alias": "", "group": "", "author": "TLC", "album": "", "date": "1994", "language": "en", "wikipedia": {"pageid": 301636, "ns": 0, "title": "CrazySexyCool", "extract": "CrazySexyCool is the second studio album by American girl group TLC. It was released on November 15, 1994, by LaFace and Arista Records. Following the group's record deal, they released their debut album Ooooooohhh... On the TLC Tip in 1992 to positive reviews and commercial success. The following year, the group began working on a follow-up; however, the recording process was unproductive due to personal struggles, notably those of member Lisa \"Left Eye\" Lopes, who was involved in a volatile romantic relationship and struggling with alcoholism. The album's recording lasted until September 1994, with Lopes' role diminished because she was in rehab.\nThe album saw the group reunite with producers Dallas Austin, Kenneth \"Babyface\" Edmonds and Jermaine Dupri as well as new collaborators Organized Noize and Chucky Thompson, and also featured contributions from Sean \"Puffy\" Combs who helped with the notable hip hop soul sound. CrazySexyCool featured hip hop beats, funk, deep grooves, propulsive rhythms and smooth production. The album's lyrical content was seen as a departure from the group's debut and was seen as a coming-of-age project which explored themes such as sexuality, romanticism, inexperience, and youthful optimism.\nCrazySexyCool was met with critical acclaim and commercial success, peaking at number three on the Billboard 200, where it spent over two years. It has been certified 12-times platinum by the Recording Industry Association of America (RIAA), making TLC the first girl group in history to be awarded diamond status. CrazySexyCool has since sold over 14 million copies worldwide, becoming the best-selling album by an American girl group. The album has since been featured on Rolling Stone magazine's list of The 500 Greatest Albums of All Time, included in the book 1001 Albums You Must Hear Before You Die and was listed as a \"New Classic\" by Entertainment Weekly in 2008. The album was also ranked as the seventh best diamond-certified album of all time by Billboard."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "疯狂性感酷", "details": ""}]}