{"album":"","alias":"","author":"Kendrick Lamar","category":"专辑","consensus_translation":"","date":"2017","group":"","id":"damn.","name":"DAMN.","language":"en","romanization":"","wikipedia":{"pageid":53711218,"ns":0,"title":"Damn (Kendrick Lamar album)","extract":"Damn (stylized as DAMN.) is the fourth studio album by American rapper Kendrick Lamar. It was released on April 14, 2017, through Top Dawg Entertainment, distributed by Aftermath Entertainment and Interscope Records.\nThe album features production from a variety of record producers, including executive producer and Top Dawg Entertainment label-head Anthony \"Top Dawg\" Tiffith, Sounwave, DJ Dahi, Mike Will Made It, and Ricci Riera; as well as further production contributions from James Blake, Steve Lacy, BadBadNotGood, Greg Kurstin, The Alchemist, and 9th Wonder, among others. Damn features appearances from singers Rihanna and Top Dawg signee Zacari, along with Irish rock band U2.\nDamn received widespread critical acclaim and topped the US Billboard 200 with 603,000 album-equivalent units earned in its first week. It also topped the chart of Canada while reaching number two in Australia, Belgium, Denmark, Ireland, the Netherlands, Norway, Sweden, and the United Kingdom. It was supported by three official singles: \"Humble\", \"Loyalty\", and \"Love\", the first of which became Lamar's first number-one single on the US Billboard Hot 100 as a lead artist. Damn was certified triple platinum by the Recording Industry Association of America (RIAA) in May 2018 and was also the Billboard Year-End number one album of 2017. \nDamn topped The Village Voice's Pazz \u0026 Jop critics poll and was named the best album of 2017 by several other publications. It became the first non-jazz or classical work to earn a Pulitzer Prize for Music and won Best Rap Album at the 2018 Grammy Awards, as well receiving a nomination for Album of the Year at the ceremony.\n\n"},"opinions":[{"details":"看到一般是翻译成”该死“、”可恶“之类书面化的语言，但是有点过于翻译腔？\n\n”妈的“也可以考虑。","github_handle":"idmimida","translation":"我操","user_name":"mimida","user_bio":"","user_avatar_url":"https://avatars0.githubusercontent.com/u/39655292?v=4"},{"details":"取damn作为感叹词的意思即可。\nhttps://pitchfork.com/news/kendrick-lamar-reveals-damns-much-longer-original-title/\n...why DAMN. was chosen as the final title: “There was so many different ways you could put it in my head. Damned if I do, damned if I don’t. The loudness of the record. When I think about ‘DNA.,’ when I think of ‘HUMBLE.,’ when I think these records, it just felt like that.”","github_handle":"davidchili","translation":"见鬼","user_name":"davidchili","user_bio":"","user_avatar_url":"https://avatars1.githubusercontent.com/u/44546760?v=4"}]}