{"id": "daytona 500", "name": "Daytona 500", "consensus_translation": "戴通纳500", "category": "歌曲", "alias": "", "group": "", "author": "Ghostface Killah", "album": "", "date": "1996", "language": "en", "wikipedia": {"pageid": 39021, "ns": 0, "title": "Daytona 500", "extract": "The Daytona 500 is a 500-mile-long (805 km) NASCAR Cup Series motor race held annually at Daytona International Speedway in Daytona Beach, Florida. It is the first of two Cup races held every year at Daytona, the second being the Coke Zero 400, and one of three held in Florida, with the annual spring showdown Dixie Vodka 400 being held at Homestead south of Miami. From 1988-2019, it was one of the four restrictor plate races on the Cup schedule. The inaugural Daytona 500 was held in 1959 coinciding with the opening of the speedway and since 1982, it has been the season-opening race of the Cup series.The Daytona 500 is regarded as the most important and prestigious race on the NASCAR calendar, carrying by far the largest purse.  Championship points awarded are equal to that of any other NASCAR Cup Series race. It is also the series' first race of the year; this phenomenon is virtually unique in sports, which tend to have championships or other major events at the end of the season rather than the start. Since 1995, U.S. television ratings for the Daytona 500 have been the highest for any auto race of the year, surpassing the traditional leader, the Indianapolis 500 which in turn greatly surpasses the Daytona 500 in in-track attendance and international viewing. The 2006 Daytona 500 attracted the sixth largest average live global TV audience of any sporting event that year with 20 million viewers.The race serves as the final event of Speedweeks and is sometimes known as \"The Great American Race\" or the \"Super Bowl of Stock Car Racing\". Since its inception, the race has been held in mid-to-late February. From 1971 to 2011, and again since 2018, the event has been as associated with Presidents Day weekend, taking place on the Sunday before the third Monday in February. On eight occasions, the race has been run on Valentine's Day .\nThe winner of the Daytona 500 since 1997 is presented with the Harley J. Earl Trophy in Victory Lane, and the winning car is displayed in race-winning condition for one year at Daytona 500 Experience, a museum and gallery adjacent to Daytona International Speedway.\nDenny Hamlin is the defending winner of the Daytona 500, having won it in 2020."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "戴通纳500", "details": ""}, {"user_name": "Tian Tang", "github_handle": "Tian-Tang", "translation": "贷通纳400 ", "details": "贷通纳是个城市，贷通纳500是个赛车比赛"}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "戴托纳500", "details": ""}]}