{"id": "dennis wilson", "name": "Dennis Wilson", "consensus_translation": "丹尼斯·威尔森", "category": "乐人", "alias": "", "group": "The Beach Boys", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 372230, "ns": 0, "title": "Dennis Wilson", "extract": "Dennis Carl Wilson (December 4, 1944 – December 28, 1983) was an American musician, singer, and songwriter who co-founded the Beach Boys. He is best remembered as their drummer and as the middle brother of bandmates Brian and Carl Wilson. Dennis was the only true surfer in the Beach Boys, and his personal life exemplified the \"California Myth\" that the band's early songs often celebrated. He was also known for his brief association with Charles Manson, a cult leader and songwriter later convicted of several murders, and for co-starring in the 1971 film Two-Lane Blacktop.\nWilson served mainly on drums and backing vocals for the Beach Boys. His playing can be heard on many of the group's hits, despite the popular misconception that he was always replaced on record by studio musicians. He originally had few lead vocals on the band's songs, but his prominence as a singer-songwriter increased following their 1968 album Friends. His music is characterized for reflecting his \"edginess\" and \"little of his happy charm\". His original songs for the group included \"Little Bird\" (1968), \"Forever\" (1970), and \"Slip On Through\" (1970). Friends and biographers also say that he was an uncredited writer on \"You Are So Beautiful\", a hit for Joe Cocker in 1974.During his final years, Wilson struggled with drug addiction which contributed to tensions with his bandmates. His solo album Pacific Ocean Blue (1977) was released to warm reviews and moderate sales. Sessions for a follow-up, Bambu, disintegrated before his death. In 1983, Wilson drowned at age 39. In 1988, he was posthumously inducted into the Rock and Roll Hall of Fame as a member of the Beach Boys.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "丹尼斯·威尔森", "details": ""}]}