{"id": "dr. dre", "name": "Dr. Dre", "consensus_translation": "德瑞医生", "category": "乐人", "alias": "", "group": "N.W.A", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 8083, "ns": 0, "title": "Dr. Dre", "extract": "Andre Romelle Young (born February 18, 1965), better known by his stage name Dr. Dre, is an American rapper, songwriter, record producer, entrepreneur, record executive, actor, and audio engineer. He is the founder and CEO of Aftermath Entertainment and Beats Electronics, and was previously co-owner of Death Row Records. Dr. Dre began his career as a member of the World Class Wreckin' Cru in 1985, and later found fame with the gangsta rap group N.W.A. The group popularized explicit lyrics in hip hop to detail the violence of street life. During the early 1990s, Dr. Dre was credited as a key figure in the crafting and popularization of West Coast G-funk, a subgenre of hip hop characterized by a synthesizer foundation and slow, heavy beats.\nDr. Dre's solo debut studio album The Chronic (1992), released under Death Row Records, made him one of the best-selling American music artists of 1993. It earned him a Grammy Award for Best Rap Solo Performance for the single \"Let Me Ride\", as well as several accolades for the single \"Nuthin' but a 'G' Thang\". That year, he produced Death Row labelmate Snoop Doggy Dogg's debut album Doggystyle, and mentored producers such as his step-brother Warren G (leading to the multi-platinum debut Regulate...G Funk Era in 1994) and Snoop Dogg's cousin Daz Dillinger (leading to the double-platinum debut Dogg Food by Tha Dogg Pound in 1995). In 1996, Dr. Dre left Death Row Records to establish his own label, Aftermath Entertainment. He produced a compilation album, Dr. Dre Presents the Aftermath, in 1996, and released a solo album, 2001, in 1999.\nDuring the 2000s, Dr. Dre focused on producing other artists, occasionally contributing vocals. He signed Eminem in 1998 and 50 Cent in 2002, and co-produced their albums. He has produced albums for and overseen the careers of many other rappers, including 2Pac, The D.O.C., Snoop Dogg, Xzibit, Knoc-turn'al, The Game, Kendrick Lamar and Anderson .Paak. Dr. Dre has also had acting roles in movies such as Set It Off, The Wash and Training Day. He has won six Grammy Awards, including Producer of the Year; Non-Classical. Rolling Stone ranked him number 56 on the list of 100 Greatest Artists of All Time. He was the second-richest figure in hip hop as of 2018 with an estimated net worth of $800 million.Accusations of Dr. Dre's violence against women have been widely publicised. Following his assault of television host Dee Barnes, he was fined $2,500, given two years' probation, ordered to undergo 240 hours of community service, and given a spot on an anti-violence public service announcement on television. A civil suit was also settled out of court. In 2015, Michel'le, the mother of one of his children, accused him of subjecting her to domestic violence during their time together as a couple. Their abusive relationship is portrayed in her 2016 biopic Surviving Compton: Dre, Suge & Michel'le. Lisa Johnson, the mother of three of Dr. Dre's children, stated that he beat her many times, including while she was pregnant. She was granted a restraining order against him. Former labelmate Tairrie B claimed that he assaulted her at a post-Grammy party in 1990, in response to her track \"Ruthless Bitch.\""}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "德瑞博士", "details": "“doctor for sick beats”的说法由来已久，dre早期也穿着手术服表演过。但按照dre.后来获得名誉博士学位时他自己的说法是“The truth is, my mother always wanted me to be a doctor, but I never had the grades. So I took the name “Dr. Dre” instead. I thought it would be easier to build a five-hundred-million-dollar entertainment empire and hope that one day a school would award me an honorary doctorate. Today is the day that happened.” https://answers.yahoo.com/question/index?qid=20120129194758AA9g1LU 另外维基百科上说“Dre的Doctor意为向NBA球员Dr. J致意”，J的情况是指“博士”。\r\nNetflix《Hip Hop Evolution》里也是翻成博士。"}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "德瑞医生", "details": "dr.dre早年参加过一支乐团叫World Class Wreckin Cru，他们有支单曲叫【surgery】，从这首曲名和其中的说唱内容来看，叫医生更准确。"}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "德瑞医生", "details": ""}]}