{"album":"","alias":"","author":"DJ Shadow","category":"专辑","consensus_translation":"完介","date":"1996","group":"","id":"endtroducing.....","name":"Endtroducing.....","language":"en","romanization":"","wikipedia":{"pageid":1324147,"ns":0,"title":"Endtroducing.....","extract":"Endtroducing..... is the debut album by American music producer DJ Shadow, released on September 16, 1996 by Mo' Wax. It is composed almost entirely of samples, mostly from vinyl records, and features moody, slow tracks and upbeat jams reminiscent of Shadow's early hip hop influences. Shadow produced Endtroducing over two years using minimal equipment, primarily an MPC60 sampler.\nIn the United Kingdom, where DJ Shadow had already established himself as a rising act, Endtroducing received critical acclaim and peaked in the top twenty of the UK Albums Chart. It was certified gold by the British Phonographic Industry. Mo' Wax issued four singles, including the chart hits \"Midnight in a Perfect World\" and \"Stem\". \nIt took considerably longer for Endtroducing to find success in the United States. After promoting the album and returning to his hometown of Davis, California, Shadow devoted his time to creating new music. During this period, interest in Endtroducing began to build among the American music press, and it peaked at 37 on the US Billboard Heatseekers Albums chart.\nEndtroducing was ranked highly on various lists of the best albums of 1996, and appears in several publications' lists of the greatest albums of the 1990s. It is considered a landmark work in instrumental hip hop, with Shadow's sampling techniques and arrangements leaving a lasting influence."},"opinions":[{"details":"译按：对大多数人来说，这张专辑是一次引介，但对影子个人而言则是一个时代性工作阶段的完结，于是他便为专辑取名“Endtroducing”=“end + introducing”。（感谢豆瓣用户2NBBD的指正。）","github_handle":"idmimida","translation":"完介","user_name":"mimida","user_bio":"","user_avatar_url":"https://avatars0.githubusercontent.com/u/39655292?v=4"},{"details":"出处：链接","github_handle":"Tian-Tang","translation":"最后的介绍","user_name":"Tian Tang","user_bio":"","user_avatar_url":""},{"details":"这个要加注释，也没法翻译，是个复合词，跟编辑商量一下吧，如果只求意思准确的话那就是：终点\u0026引入。Shadow在采访里说过：这是end+introducing，为什么用end这个词？因为当时专辑制作完成后，他就意识到这种纯采样的音乐作品已经被自己玩到头了，穷尽了。以后不会再创作类似手法的作品。","github_handle":"redhousepainter","translation":"终点\u0026引入","user_name":"redhousepainter","user_bio":"","user_avatar_url":""}]}