{"id": "enter the wu-tang (36 chambers)", "name": "Enter the Wu-Tang (36 Chambers)", "consensus_translation": "走进武当（三十六房）", "category": "专辑", "alias": "", "group": "", "author": "Wu-Tang Clan", "album": "", "date": "1993", "language": "en", "wikipedia": {"pageid": 194557, "ns": 0, "title": "Enter the Wu-Tang (36 Chambers)", "extract": "Enter the Wu-Tang (36 Chambers) is the debut studio album by American hip-hop group Wu-Tang Clan, released on November 9, 1993, by Loud Records. Recording sessions took place during early-to-mid 1993 at Firehouse Studio in New York City, and the album was produced by the group's de facto leader RZA. Its title originates from the martial arts films Enter the Dragon (1973) and The 36th Chamber of Shaolin (1978).The gritty, distinctive sound of Enter the Wu-Tang (36 Chambers) created a blueprint for hardcore hip-hop during the 1990s, and helped return New York City hip-hop to national prominence. Its sound also became greatly influential in modern hip-hop production, while the group members' explicit, humorous, and free-associative lyrics have served as a template for many subsequent hip-hop records. Serving as a landmark release in the era of hip-hop known as the East Coast Renaissance, its influence helped lead the way for several other East Coast hip-hop artists, including Nas, The Notorious B.I.G., Mobb Deep, and Jay-Z.\nDespite its raw, underground sound, the album had surprising chart success, peaking at number 41 on the US Billboard 200 chart, selling 30,000 copies in its first week on sale. By 1995 it was certified Platinum by the Recording Industry Association of America, and in October 2018 it was certified triple platinum. Initially receiving positive reviews from most music critics, Enter the Wu-Tang (36 Chambers) is widely regarded as one of the most significant albums of the 1990s, as well as one of the greatest hip-hop albums of all time."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "走进武当（三十六房）", "details": ""}]}