{"id": "flashdance", "name": "Flashdance", "consensus_translation": "闪电舞", "category": "影视剧", "alias": "", "group": "", "author": "", "album": "", "date": "1983", "language": "en", "wikipedia": {"pageid": 168602, "ns": 0, "title": "Flashdance", "extract": "Flashdance is a 1983 American romantic drama film directed by Adrian Lyne and starring Jennifer Beals as a passionate young dancer who aspires to become a professional ballerina (Alex), alongside Michael Nouri playing her elder suitor and the owner of the steel mill where she works by day in Pittsburgh. It was the first collaboration of producers Don Simpson and Jerry Bruckheimer, and the presentation of some sequences in the style of music videos was an influence on other 1980s films including Footloose, Purple Rain, and Top Gun, Simpson and Bruckheimer's most famous production. It was also one of Lyne's first major film releases, building on a reputation for making popular television commercials. Alex's elaborate dance sequences were shot using body doubles (Beals' main double was the uncredited French actress Marine Jahan, while a breakdance move was doubled by the male dancer Crazy Legs).The film opened to negative reviews by professional critics, including Roger Ebert, who panned it as \"great sound and flashdance, signifying nothing\" (and eventually placed it on his 'most hated' list). Nevertheless, it was a surprise box-office success, becoming the third-highest-grossing film of 1983 in the United States. Its worldwide box-office gross exceeded $200 million. The soundtrack, compiled by Giorgio Moroder, spawned several hit songs, including \"Maniac\" (performed by Michael Sembello), and the Academy Award-winning \"Flashdance... What a Feeling\", which was written for the film by Moroder, with lyrics by Keith Forsey and the singer Irene Cara. Flashdance is also often remembered for an iconic film poster featuring Beals sporting a sweatshirt with a large neck hole (according to the actress, her look in the scene came about by accident after she simply cut a large hole at the top of one that had shrunk in the wash)."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "闪电舞", "details": ""}]}