{"id": "frankie goes to hollywood", "name": "Frankie Goes to Hollywood", "consensus_translation": "弗兰基去好莱坞", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 11229, "ns": 0, "title": "Frankie Goes to Hollywood", "extract": "Frankie Goes to Hollywood were a British band formed in Liverpool, England, in the 1980s. The group was fronted by Holly Johnson (vocals), with Paul Rutherford (vocals), Peter Gill (drums, percussion), Mark O'Toole (bass guitar) and Brian Nash (guitar).\nThe group's 1983 debut single \"Relax\" was banned by the BBC in 1984 while at number six in the charts and subsequently topped the UK Singles Chart for five consecutive weeks, going on to enjoy prolonged chart success throughout that year and ultimately becoming the seventh-best-selling UK single of all time. It also won the 1985 Brit Award for Best British Single. Their debut album, Welcome to the Pleasuredome, reached number one in the UK in 1984 with advanced sales of over one million. After the follow-up success of \"Two Tribes\" and \"The Power of Love\", the group became only the second act in the history of the UK charts to reach number one with their first three singles; the first being fellow Liverpudlians Gerry and the Pacemakers from the 1960s. This record remained unbeaten until the Spice Girls achieved a six-single streak in 1996–1997.\nIn 1985 the band won the Brit Award for British Breakthrough Act. Associated with the Second British Invasion of the US, they also received Grammy Award and MTV Video Music Award nominations for Best New Artist. Songwriters Johnson, Gill and O'Toole received the 1984 Ivor Novello Award from the British Academy of Songwriters, Composers, and Authors for Best Song Musically and Lyrically for \"Two Tribes\". In 2015, the song was voted by the British public as the nation's 14th-favourite 1980s number one in a poll for ITV."}, "opinions": [{"mimida": {"user_name": "mimida", "github_handler": "mimida", "translation": "弗兰基去好莱坞", "details": ""}}]}