{"id": "gaucho", "name": "Gaucho", "consensus_translation": "高卓人", "category": "专辑", "alias": "", "group": "", "author": "Steely Dan", "album": "", "date": 1980.0, "language": "en", "wikipedia": {"pageid": 386905, "ns": 0, "title": "Gaucho", "extract": "A gaucho (Spanish: [ˈɡawtʃo]) or gaúcho (Portuguese: [ɡaˈuʃu]) is a skilled horseman, reputed to be brave and unruly. The gaucho is a national symbol in Argentina and Uruguay, but is also a strong culture in southern Brazil. Gauchos became greatly admired and renowned in legends, folklore and literature and became an important part of their regional cultural tradition. Beginning late in the 19th century, after the heyday of the gauchos, they were celebrated by South American writers.\nThe gaucho in some respects resembled members of other nineteenth century rural, horse-based cultures such as the North American cowboy (vaquero in Spanish), the Chilean huaso, the Peruvian chalan or morochuco, the Venezuelan or Colombian llanero, the Hawaiian paniolo, the Mexican charro or the Portuguese campino.\nAccording to the Diccionario de la lengua española, in its historical sense a gaucho was \"a mestizo who, in the 18th and 19th centuries, inhabited Argentina and Uruguay was a migratory horseman, and adept in cattle work\". In Argentina and Uruguay today a gaucho is, according to the same source, simply \"A country person, experienced in traditional livestock farming\".  \nBecause historical gauchos were reputed to be brave, if unruly, the word is also applied metaphorically to mean \"Noble, brave and generous\", but also \"One who is skilful in subtle tricks, crafty\". In Portuguese the word gaúcho (note the accent) means \"An inhabitant of the plains of Rio Grande do Sul or the pampas of Argentina descended from European man and aboriginal woman who devotes himself to lassoing and raising cattle and horses\"; and in Brazil gaúcho has also acquired a metonymic signification, meaning anyone, even an urban dweller, who is a citizen of the State of Rio Grande do Sul. In its purest sense, gaucho referred to the nomadic, often outlaw inhabitants of the great plains of Argentina and Uruguay. In current usage, gaucho usually designates the rural rancher in general.\""}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "高卓人", "details": ""}]}