{"id": "get ur freak on", "name": "Get Ur Freak On", "consensus_translation": "异想天开", "category": "歌曲", "alias": "", "group": "", "author": "Missy Elliott", "album": "", "date": "2001", "language": "en", "wikipedia": {"pageid": 6503828, "ns": 0, "title": "Get Ur Freak On", "extract": "\"Get Ur Freak On\" is a song by American recording artist Missy \"Misdemeanor\" Elliott. It was written and produced by Elliott and Timbaland for her third studio album Miss E... So Addictive (2001). Based on heavy bhangra elements, a popular music and dance form from the Punjab state of India, the song features a six-note base that is a Punjabi melody played on a tumbi and rhythm and bassline played on tabla.Released as the album's first single in 2001, the track reached number seven on the US Billboard Hot 100 chart. Internationally, \"Get Ur Freak On\" became a top ten success in the Netherlands and the United Kingdom, where it became her first solo top ten hit, peaking at number four. A remix of the song featuring Nelly Furtado was a dance club hit during this period, and was used both in the soundtrack and in the background of the movie Lara Croft: Tomb Raider (2001) starring Angelina Jolie. The song is also heard in The Rundown (2003) starring Dwayne Johnson (remixed with AC/DC's \"Back in Black\") and The 40-Year-Old Virgin (2005) starring Steve Carell.\nIn December, the song was listed 14th on Rolling Stone's Best Songs of the Decade ranking, and later at number 466 on their The 500 Greatest Songs of All Time updated list of 2010. In 2002, \"Get Ur Freak On\" was named the best single released in the year 2001 by The Village Voice's Pazz & Jop annual year-end critics' poll. The song also lists at number seven on Pitchfork Media's Top 500 Songs of the 2000s and number 16 on VH1's Greatest Songs of Hip-Hop. In 2011, NME placed it at number 17 on its list \"150 Best Tracks of the Past 15 Years\". In April 2014, the song was remixed with The Black Keys' song \"Keep Me\" for the original soundtrack to Neighbors (2014). It was heard once in the TV spots for Goosebumps 2: Haunted Halloween.\nOn the Billboard magazine issue dated February 21, 2015, \"Get Ur Freak On\" re-entered at #40, more than a decade after its original chart run. This re-entry was spawned by Missy Elliott's performance at the Super Bowl XLIX halftime show that occurred earlier in the month."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "异想天开", "details": "台译"}]}