{"id": "guru", "name": "Guru", "consensus_translation": "古鲁", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 167936, "ns": 0, "title": "Guru", "extract": "Guru (, UK also ; Sanskrit: गुरु, IAST: guru) is a Sanskrit term for a \"teacher, guide, expert, or master\" of certain knowledge or field. In pan-Indian traditions, guru is more than a teacher, in Sanskrit guru means the one who dispels the darkness and takes towards light, traditionally a reverential figure to the student, with the guru serving as a \"counselor, who helps mold values, shares experiential knowledge as much as literal knowledge, an exemplar in life, an inspirational source and who helps in the spiritual evolution of a student\". A guru is also one's spiritual guide, who helps one to discover the same potentialities that the guru has already realized. In the Tagalog language, Indonesian and Malay the word means teacher.\nThe oldest references to the concept of guru are found in the earliest Vedic texts of Hinduism. The guru, and gurukul – a school run by guru, were an established tradition in India by the 1st millennium BCE, and these helped compose and transmit the various Vedas, the Upanishads, texts of various schools of Hindu philosophy, and post-Vedic Shastras ranging from spiritual knowledge to various arts. By about mid 1st millennium CE, archaeological and epigraphical evidence suggest numerous larger institutions of gurus existed in India, some near Hindu temples, where guru-shishya tradition helped preserve, create and transmit various fields of knowledge. These gurus led broad ranges of studies including Hindu scriptures, Buddhist texts, grammar, philosophy, martial arts, music and painting.The tradition of guru is also found in Jainism, referring to a spiritual preceptor, a role typically served by a Jain ascetic. In Sikhism, the guru tradition has played a key role since its founding in the 15th century, its founder is referred to as Guru Nanak, and its scripture as Guru Granth Sahib. The guru concept has thrived in Vajrayāna Buddhism, where the tantric guru is considered a figure to worship and whose instructions should never be violated.In the Western world, the term is sometimes used in a derogatory way to refer to individuals who have allegedly exploited their followers' naiveté, particularly in certain tantra schools, self-help, hippie and new religious movements."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "古鲁", "details": ""}]}