{"id": "hieroglyphics", "name": "Hieroglyphics", "consensus_translation": "象形文字", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 50953, "ns": 0, "title": "Egyptian hieroglyphs", "extract": "Egyptian hieroglyphs  were the formal writing system used in Ancient Egypt. Hieroglyphs combined logographic, syllabic and alphabetic elements, with a total of some 1,000 distinct characters. Cursive hieroglyphs were used for religious literature on papyrus and wood. The later hieratic and demotic Egyptian scripts were derived from hieroglyphic writing, as was the Proto-Sinaitic script that later evolved into the Phoenician alphabet. Through the Phoenician alphabet's major child systems, the Greek and Aramaic scripts, the Egyptian hieroglyphic script is ancestral to the majority of scripts in modern use, most prominently the Latin and Cyrillic scripts (through Greek) and the Arabic script and Brahmic family of scripts (through Aramaic).\nThe use of hieroglyphic writing arose from proto-literate symbol systems in the Early Bronze Age, around the 32nd century BC (Naqada III), with the first decipherable sentence written in the Egyptian language dating to the Second Dynasty (28th century BC). Egyptian hieroglyphs developed into a mature writing system used for monumental inscription in the classical language of the Middle Kingdom period; during this period, the system made use of about 900 distinct signs. The use of this writing system continued through the New Kingdom and Late Period, and on into the Persian and Ptolemaic periods. Late survivals of hieroglyphic use are found well into the Roman period, extending into the 4th century AD.With the final closing of pagan temples in the 5th century, knowledge of hieroglyphic writing was lost. Although attempts were made, the script remained undeciphered throughout the Middle Ages and the early modern period. The decipherment of hieroglyphic writing was finally accomplished in the 1820s by Jean-François Champollion, with the help of the Rosetta Stone."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "象形文字", "details": ""}]}