{"id": "hollaback girl", "name": "Hollaback Girl", "consensus_translation": "招之即来挥之即去的女孩", "category": "歌", "alias": "", "group": "", "author": "Gwen Stefani", "album": "", "date": "2005", "language": "en", "wikipedia": {"pageid": 1811903, "ns": 0, "title": "Hollaback Girl", "extract": "\"Hollaback Girl\" is a song by American singer Gwen Stefani from her debut solo studio album, Love. Angel. Music. Baby. (2004). It is a hip hop song that draws influence from 1980s hip hop and dance music. The song was written by Stefani, Pharrell Williams and Chad Hugo; it was released as the album's third single on March 15, 2005, and was one of the year's most popular songs, peaking inside the top 10 of the majority of the charts it entered. It reached number one in Australia and the United States, where it became the first digital download to sell one million copies.\n\"Hollaback Girl\" received several award nominations, including Best Female Pop Vocal Performance and Record of the Year at the 48th Grammy Awards, but lost in both categories. \"Hollaback Girl\" divided pop music critics, with some praising its minimalistic production and others declaring it embarrassing; men's magazine Maxim named it as the \"Most Annoying Song Ever\". In the United States, it topped the Billboard Hot 100 for four weeks and was ranked at number two on the Year-End Hot 100. The single topped the charts in Australia and reached the top-ten in several other countries, including Ireland, Italy, New Zealand and the United Kingdom. It has since been certified Platinum in United States by the RIAA, and in Australia by the ARIA.\nA music video representing Stefani as a cheerleader at a California high school was released on March 21, 2005, and was directed by Paul Hunter. The video received four nominations at the 2005 MTV Video Music Awards, and ultimately won for Best Choreography. Stefani has performed \"Hollaback Girl\" on numerous occasions, including on all three of her concert tours, and on several televised appearances."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "招之即来挥之即去的女孩", "details": ""}]}