{"id": "ice cube", "name": "Ice Cube", "consensus_translation": "冰块", "category": "乐人", "alias": "", "group": "N.W.A", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 148328, "ns": 0, "title": "Ice Cube", "extract": "O'Shea Jackson (born June 15, 1969), called Ice Cube, is an American rapper, actor, and filmmaker. His lawless lyrics on N.W.A's 1988 album Straight Outta Compton led gangsta rap's outbreak. Yet his solo albums of 1990 and 1991 rank high in political rap. In 1991 and 1995, entering film, he starred in Boyz n the Hood and cocreated Friday.\nIn 1988, Cube had found fame, alongside Eazy-E and Dr. Dre, as a member of pioneering gangsta rap group N.W.A. Its leading rapper, Cube also wrote some of Dre's and most of Eazy's lyrics on Straight Outta Compton. A music and cultural landmark, this album introduced lyrical content extremely violent, threatening to attack abusive police and innocent civilians alike, lyrics pushing boundaries. Leaving N.W.A in December 1989, Cube launched a solo rap career.\nHis first two albums, AmeriKKKa's Most Wanted in 1990 and Death Certificate in 1991, likewise delivered lyrics forcefully and incited some controversy, but were generally more conscious and reflective, offering sociopolitical criticism. Swiftly certified Platinum and drawing numerous accolades, these albums would be cited by later rappers as important influences, while Cube routinely appears on critics' lists of the greatest rappers. Yet early in his solo acclaim, he entered cinema.\nIn a screen performance praised for its authenticity, Cube starred in director John Singleton's feature debut, the 1991 film Boyz n the Hood. Cube cowrote and starred in the 1995 film Friday, premising Friday sequels, reshaping his persona into movie star. His directorial debut was a 1998 film, The Player's Club. His numerous acting roles include the Barbershop film series, begun in 2002, and the Ride Along films. Also an executive producer of those 2010s films, he is likewise of the 2015 biopic Straight Outta Compton, on N.W.A's story.\nIn 2010, while his film Are We There Yet? was spun into a sitcom, sports network ESPN aired Ice Cube's directed documentary Straight Outta L.A., about the backstory of gangsta rap's emergence and the artists' finding symbolism in Raiders football, an unwritten endorsement and symbiosis. Otherwise, over 25 years since his early albums, he released his tenth solo album, still aiming for political statement. In business, he launched a clothing line, Solo by Cube, as well as a 3-on-3 basketball league, Big3, mainly featuring retired NBA players.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "冰块", "details": "网上翻成“冰块酷巴”的倒是挺多的，这种误译是否有必要沿用？"}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "冰块", "details": "冰块就行了"}]}