{"id": "irreplaceable", "name": "Irreplaceable", "consensus_translation": "不可替代", "category": "歌", "alias": "", "group": "", "author": "Beyonce", "album": "", "date": 2006.0, "language": "en", "wikipedia": {"pageid": 6774768, "ns": 0, "title": "Irreplaceable", "extract": "\"Irreplaceable\" is a song recorded by American singer Beyoncé for her second studio album, B'Day (2006). The song was written by Shaffer \"Ne-Yo\" Smith, Tor Erik Hermansen, Mikkel, S. Eriksen, Espen Lind, Amund Bjørklund, Beyoncé and produced by Stargate and Beyoncé. \"Irreplaceable\" was originally a country record; it was re-arranged as a mid-tempo ballad with pop and R&B influences by modifying the vocal arrangements and instrumentation. During the production and recording sessions, Beyoncé and Ne-Yo wanted to create a record which people of either gender could relate to. The song's lyrics are about the breakdown of a relationship with an unfaithful man and the song contains a message about female empowerment.\nFollowing the moderate chart performances of \"Déjà Vu\" and \"Ring the Alarm\", \"Irreplaceable\" was released internationally on October 23, 2006 as the album's second single, and the third in the United States on December 5, 2006. The single was released through Columbia Records. Pitchfork Media and Rolling Stone placed it on their lists of Best Songs of the 2000s. \"Irreplaceable\" won several awards, including Best R&B/Soul Single at the 2007 Soul Train Music Awards. It was nominated for the Record of the Year award at the 50th Grammy Awards.\nThe single became Beyoncé's fourth number-one in the U.S., was B'Day's most successful release, and remained at the top of the U.S. Billboard Hot 100 chart for ten consecutive weeks. \"Irreplaceable\" was the twenty-fifth most successful song of the 2000s (decade) in the U.S., and was certified double-platinum by the Recording Industry Association of America (RIAA). It became Beyoncé's second single to achieve 200 million audience impressions in 2006. She is the second singer to achieve this feat in the U.S., the first having been Mariah Carey in 2005. \"Irreplaceable\" peaked at number one in Australia, at number four in the United Kingdom, and reached the top twenty in several European countries. \"Irreplaceable\" was 2007's tenth best-selling digital single with over 4.6 million copies sold worldwide.The single's accompanying music video was directed by Anthony Mandler and served as the debut performance of Beyoncé's all-female band, Suga Mama. The video was included on the 2007 B'Day Anthology Video Album, and a video edit was produced for \"Irreemplazable\", the Spanish version of the song. It won the Video of the Year award at the 2007 Black Entertainment Television (BET) Awards, and was nominated for the MTV Video Music Award for Video of the Year at the 2007 Awards. \"Irreplaceable\" has regularly featured in Beyoncé's tours and live performances since 2006. The American Society of Composers, Authors and Publishers (ASCAP) recognized the song as one of the most performed of 2007 at the ASCAP Pop Music Awards."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "不可替代", "details": ""}]}