{"id": "jack bruce", "name": "Jack Bruce", "consensus_translation": "杰克·布鲁斯", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 178802, "ns": 0, "title": "Jack Bruce", "extract": "John Symon Asher Bruce (14 May 1943 – 25 October 2014) was a Scottish singer-songwriter, musician and composer. He gained popularity as the co-lead vocalist, and bass guitarist of British rock band Cream. After the group disbanded in 1968, he pursued a solo career and also played with several bands. \nIn the early 1960s Bruce joined the Graham Bond Organisation, where he met his future bandmate Ginger Baker. After leaving the Graham Bond Organisation, he joined with John Mayall & the Bluesbreakers, where he met Eric Clapton, who also was his future bandmate. His time with the band was brief. In 1966, he formed Cream with lead guitarist Clapton and drummer Baker; he co-wrote some of their hits (including \"Sunshine of Your Love\", \"White Room\" and \"I Feel Free\") with songwriter Pete Brown. After the group disbanded Bruce formed his own blues-rock band West, Bruce and Laing in 1972, with guitarist Leslie West and drummer Corky Laing. In the late 1960s he began recording solo albums. His first solo album, Songs for a Tailor, released in 1969, was a worldwide hit. His solo career spanned several decades. From the 1970s to the 1990s he played with several groups as a touring member. He reunited with Cream in 2005 for concerts at the Royal Albert Hall and at Madison Square Garden in New York. \nBruce is considered to be one of the most important and influential bass guitarists of all time. Rolling Stone magazine readers ranked him number eight on their list of \"10 Greatest Bass Guitarist Of All Time\". He was inducted in the Rock and Roll Hall of Fame in 1993, and was awarded the Grammy Lifetime Achievement Award in 2006, both as a member of Cream. \nHis first marriage was with Janet Godfrey in 1964, with whom he had two sons, Jonas and Malcolm. Their marriage ended in divorce in 1981. His second marriage was with Margret Seyfer in 1982, with whom he had two daughters Natascha, Kyla and a son named Corin. He died of liver disease on 25 October 2014 in England, aged 71. At the time of his death he had a net worth of 20 million dollars."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "杰克·布鲁斯", "details": ""}]}