{"id": "jamie foxx", "name": "Jamie Foxx", "consensus_translation": "杰米·福克斯", "category": "影人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 325191, "ns": 0, "title": "Jamie Foxx", "extract": "Eric Marlon Bishop (born December 13, 1967), better known by his stage name Jamie Foxx, is an American actor, singer, comedian, songwriter, and producer. Foxx became widely known for his portrayal of Ray Charles in the 2004 biographical film Ray, for which he won the Academy Award, BAFTA, Screen Actors Guild Award, Critics' Choice Movie Award and Golden Globe Award for Best Actor. That same year, he was nominated for the Academy Award for Best Supporting Actor for his role in the crime film Collateral. Since spring 2017, Foxx has served as the host and executive producer of the Fox game show Beat Shazam.\nOther acting roles include Staff Sergeant Sykes in Jarhead (2005), record executive Curtis Taylor Jr. in Dreamgirls (2006), Detective Ricardo Tubbs in the 2006 film adaptation of TV series Miami Vice, the title role in the film Django Unchained (2012), the supervillain Electro in The Amazing Spider-Man 2 (2014), Will Stacks in Annie (2014), gangster Bats / Leon Jefferson III in Baby Driver (2017) and as Walter McMillian in Just Mercy (2019), where he received a SAG Award nomination. In 1991, Foxx joined the cast as a featured player in the sketch comedy show In Living Color until the show's end in 1994. Following this success, Foxx was given his own television sitcom The Jamie Foxx Show, in which he starred, co-created and produced, airing for five highly-rated seasons from 1996 to 2001 on The WB Television Network. \nFoxx is also a Grammy Award-winning musician, producing four albums, which have charted in the top ten of the U.S. Billboard 200: Unpredictable (2005), which topped the chart, Intuition (2008), Best Night of My Life (2010), and Hollywood: A Story of a Dozen Roses (2015)."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "杰米·福克斯", "details": ""}]}