{"id": "jodeci", "name": "Jodeci", "consensus_translation": "乔戴西", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 239452, "ns": 0, "title": "Jodeci", "extract": "Jodeci ( JOH-də-see) is an American R&B quartet with members DeVanté Swing, Mr. Dalvin, K-Ci, and JoJo.  Formed in 1989 in Charlotte, North Carolina, Jodeci's members began their musical careers as two duos of brothers and, after years of limited success, joined forces.  After signing with Uptown Records in 1991, the group began to work on their debut album, Forever My Lady, which brought them mainstream success with the Billboard Hot 100 single \"Come and Talk to Me\" and the album's titular track.The group's critical and commercial success continued with the releases of Diary of a Mad Band (1993), and also with The Show, the After Party, the Hotel (1995), where the group experimented with various musical styles typically not associated with traditional R&B. Jodeci would incorporate hip hop soul, gospel and new jack swing into their music, which led to the group featured prominently with hip hop artists during the 1990s. Each album released by the group during this period attained platinum certification by the Recording Industry Association of America (RIAA), and helped to redefine the genre, allowing for developments in thematic and musical content within R&B.In 1996, they announced a hiatus - though continuing to work on music as a group - which prompted K-Ci & JoJo to branch off as a duo, releasing five albums until 2013, when the group re-united for their fourth studio album, The Past, the Present, the Future (2015). Jodeci has sold more than 20 million records worldwide to date. Complex magazine ranks the group 1st on their \"1990s Male R&B Group Pyramid of Excellence\" list in 2014, one of the most influential groups of the 1990s, and the best R&B group of all time. Damon \"Smooth\" Hart was the last manager of Jodeci."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "乔戴西", "details": "台港译法"}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "乔迪西", "details": ""}]}