{"id": "john dillinger", "name": "John Dillinger", "consensus_translation": "约翰·迪林杰", "category": "影人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 42091, "ns": 0, "title": "John Dillinger", "extract": "John Herbert Dillinger (; June 22, 1903 – July 22, 1934) was an American gangster active during the Great Depression. He operated with a group of men known as the \"Dillinger Gang\" or \"The Terror Gang\" which was accused of robbing 24 banks and four police stations, among other crimes. Dillinger escaped from jail twice. He was also charged with the murder of an East Chicago, Indiana police officer who shot Dillinger in his bullet-resistant vest during a shootout, prompting him to return fire; he was not convicted of this crime. However, it was Dillinger's only homicide charge, despite his infamy.\nHe courted publicity and the media ran exaggerated accounts of his bravado and colorful personality, styling him as a Robin Hood figure. In response, J. Edgar Hoover, then Director of the Bureau of Investigation (BOI), used Dillinger and his gang as his campaign platform to evolve the BOI into the Federal Bureau of Investigation, developing more sophisticated investigative techniques as weapons against organized crime.After evading police in four states for almost a year, Dillinger was wounded and returned to his father's home to recover. He returned to Chicago in July 1934 and sought refuge in a brothel owned by Ana Cumpănaș, who informed police and federal agents of his whereabouts. On July 22, 1934, the police and the Division of Investigation closed in on the Biograph Theater. Federal agents, led by Melvin Purvis and Samuel P. Cowley]], moved to arrest Dillinger as he exited the theater. He drew a Colt Model 1908 Vest Pocket and attempted to flee, but was killed. This was ruled as justifiable homicide."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "约翰·迪林杰", "details": ""}]}