{"id": "justin bieber", "name": "Justin Bieber", "consensus_translation": "贾斯汀比伯", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 23680998, "ns": 0, "title": "Justin Bieber", "extract": "Justin Drew Bieber (; born March 1, 1994) is a Canadian singer, songwriter, and actor. Discovered at 13 years old by talent manager Scooter Braun after he had watched his YouTube cover song videos, Bieber was signed to RBMG Records in 2008. With Bieber's debut EP My World, released in late 2009, Bieber became the first artist to have seven songs from a debut record chart on the Billboard Hot 100.Bieber released his debut studio album My World 2.0 in 2010. Containing the hit single \"Baby\", the album debuted at number one on the US Billboard 200, making Bieber the youngest solo male act to top the chart in 47 years. Following his debut album and promotional tours, he released his 3D biopic-concert film Justin Bieber: Never Say Never, which was a box office success. In the years after the releases of the Under the Mistletoe (2011) and Believe (2012), Bieber had established himself as a teen idol, but faced several controversies, including run-ins with the law internationally before his first arrest in 2014.Following the controversies surrounding Bieber, his sound became more mature as he transitioned into EDM and moved away from teen pop. Released in 2015, his fourth studio album Purpose became his most commercially successful album, spawning three Billboard Hot 100 number-one singles: \"What Do You Mean?\", \"Sorry\", and \"Love Yourself\". After the release of Purpose, Bieber had featured on several successful collaborations, including \"Cold Water\", \"Let Me Love You\", \"Despacito (Remix)\", \"I'm the One\", \"I Don't Care\" and \"10,000 Hours\". After taking some time off to refocus on his marriage to American model Hailey Baldwin, Bieber returned with solo material in 2020 with the release of his fifth studio album, Changes.Bieber has sold more than 150 million records, making him one of the world's best-selling music artists. He has won numerous awards, including a Grammy Award, 15 American Music Awards, 20 Billboard Music Awards, two Brit Awards, a Latin Grammy Award, a record 21 MTV Europe Music Awards, and three MTV Video Music Awards. Time magazine included Bieber in their 2011 edition of the 100 most influential people in the world list. He was included by Forbes list of the top ten most powerful celebrities in the world, in 2011, 2012 and 2013. In 2016, Bieber became the first artist to surpass 10 billion total video views on Vevo."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "贾斯汀比伯", "details": ""}]}