{"id": "kid cudi", "name": "Kid Cudi", "consensus_translation": "卡迪小子", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 19583036, "ns": 0, "title": "Kid Cudi", "extract": "Scott Ramon Seguro Mescudi (born January 30, 1984), better known by his stage name Kid Cudi (; often stylized as KiD CuDi), is an American rapper, singer, songwriter, musician, record producer and actor from Cleveland, Ohio. He has widely been recognized as an influence on several hip hop and alternative acts. Cudi's first full-length project, a mixtape titled A Kid Named Cudi (2008) caught the attention of American rapper-producer Kanye West, who signed Cudi to his GOOD Music label imprint in late 2008.\nReleased in 2008, Cudi's debut single \"Day 'n' Nite\" was a worldwide hit. His debut studio album Man on the Moon: The End of Day (2009) was certified double platinum by the Recording Industry Association of America (RIAA). In 2010, he released his second album Man on the Moon II: The Legend of Mr. Rager, and formed the rock band WZRD with his long-time collaborator Dot da Genius. Their eponymous debut album (2012) debuted at number one on the Billboard Top Rock Albums chart. Cudi has since released the solo albums Indicud (2013), Satellite Flight: The Journey to Mother Moon (2014), Speedin' Bullet 2 Heaven (2015) and Passion, Pain & Demon Slayin' (2016). Cudi's joint album with West, under the eponymous name Kids See Ghosts (2018), was met with widespread critical acclaim and was named among the best albums of 2018. In 2020, Cudi earned his first number-one song on the Billboard Hot 100 with \"The Scotts\", a collaboration with American rapper Travis Scott.\nCudi has sold 16 million certified records in the United States and has won a Grammy Award. He has worked with numerous prominent artists in the music industry, including Scott, Jay Z, West, Mary J. Blige, David Guetta, MGMT, Shakira, Snoop Dogg, Kendrick Lamar and Michael Bolton. After signing to GOOD Music, Cudi has since gone on to launch his own record label imprints, the now-dissolved Dream On and current independent label Wicked Awesome Records. Cudi also ventured into acting when he was cast in the HBO series How to Make It in America. He has appeared in several feature films, including Goodbye World (2013), Need for Speed (2014), and Entourage (2015). In addition, he has made appearances on television shows such as One Tree Hill, The Cleveland Show, Brooklyn Nine-Nine, and Westworld. In 2015, he was the bandleader on the IFC series Comedy Bang! Bang!\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "卡迪小子", "details": ""}]}