{"id": "l.a. reid", "name": "L.A. Reid", "consensus_translation": "L.A.里德", "category": "乐人", "alias": "", "group": "L.A. & Babyface", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 1731470, "ns": 0, "title": "L.A. Reid", "extract": "Antonio Marquis \"L.A.\" Reid (born June 7, 1956) is an American record executive, record producer, composer, former drummer, songwriter, A&R representative, film producer, businessman and author. He founded and served as co-chairman of Hitco Entertainment. He has served as the chairman and CEO of Epic Records and The Island Def Jam Music Group, the president and CEO of Arista Records. \nReid was the founder and CEO of Hitco Music Publishing and the co-founder of LaFace Records with producing partner Kenneth \"Babyface\" Edmonds. He has won three Grammy Awards, picking up awards as a songwriter for songs such as Boyz II Men's \"End Of The Road.\"Over the course of his career he has written and produced for many artists including Bobby Brown, Johnny Gill, Outkast, Toni Braxton, TLC, Mariah Carey, Avril Lavigne, Paula Abdul, Pink, Justin Bieber, Meghan Trainor, Rihanna, Kanye West, Usher, Ne-Yo, 21 Savage, Young Jeezy, Ciara, Zara Larsson, Jidenna, Jennifer Lopez, Future, Travis Scott, Fifth Harmony, DJ Khaled, Death Grips, Rick Ross, Halsey, Whitney Houston, and The Jacksons.\nHe appeared as a judge on the first two seasons of the U.S. version of the television show The X Factor, but left the show in December 2012 to focus on his leadership at Epic Records. One of the major projects that Reid embarked on following his stint on The X Factor, was the remaking of Michael Jackson songs after his death, with the May 13, 2014 release of the album XScape.  In 2016, Reid published the New York Times bestselling memoir Sing to Me: My Story of Making Music, Finding Magic, and Searching for Who's Next.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "L.A.里德", "details": ""}]}