{"id": "lauryn hill", "name": "Lauryn Hill", "consensus_translation": "劳伦·希尔", "category": "乐人", "alias": "", "group": "Fugees", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 162864, "ns": 0, "title": "Lauryn Hill", "extract": "Lauryn Noelle Hill (born May 26, 1975) is an American singer, songwriter and rapper known for being a member of Fugees, and for her solo album The Miseducation of Lauryn Hill, which won many awards and broke several sales records. Often regarded as one of the greatest rappers of all time, as well as being a pioneer in the Neo soul genre. Hill is widely credited for breaking barriers for female rappers, popularizing melodic rapping and for bringing Hip hop to Popular music. She has influenced many artists of various genres.\nRaised mostly in South Orange, New Jersey, Hill began singing with her music-oriented family during her childhood. She appeared in the 1993 film Sister Act 2: Back in the Habit alongside Whoopi Goldberg. In high school, Hill was approached by Pras Michel for a band he started, which his cousin Wyclef Jean soon joined. They renamed themselves the Fugees and released the albums Blunted on Reality (1994), and the Grammy Award–winning The Score (1996), which sold six million copies in the U.S. Hill rose to prominence for her African-American and Caribbean music influences on her rapping and singing and, most notably, her performance on the Fugees version of \"Killing Me Softly\". Her tumultuous romantic relationship with Wyclef Jean led to the split of the band in 1997, after which she began to focus on solo projects.\nThe Miseducation of Lauryn Hill (1998) remains Hill's only solo studio album. It received critical acclaim showcasing a representation of life and relationships and locating a contemporary voice within the neo soul genre. The album debuted at number one on the U.S. Billboard 200 and has sold approximately eight million copies there. This included the singles \"Doo Wop (That Thing),\" \"Ex-Factor,\" and \"Everything Is Everything\". At the 41st Grammy Awards, the record earned her five awards, including Album of the Year and Best New Artist. During this time, she won several other awards and became a common sight on the cover of magazines.Soon afterward, Hill dropped out of the public eye, dissatisfied with the music industry and suffering from the pressures of fame. Her last full-length recording, the new-material live album MTV Unplugged No. 2.0 (2002), sharply divided critics, it sold approximately one million copies in the U.S., comparably less to her first album and work with the Fugees. Hill's subsequent activity, which includes the release of a few songs and occasional festival appearances, has been sporadic. Her music and public statements have become critical of pop culture and societal institutions. Hill has six children, five of them with Rohan Marley. In 2012 she pleaded guilty to tax evasion and served a three-month prison sentence the following year.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "劳伦·希尔", "details": ""}]}