{"id": "marshall bruce mathers iii", "name": "Marshall Bruce Mathers III", "consensus_translation": "马绍尔·布鲁斯·马瑟斯三世", "category": "乐人", "alias": "Eminem", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 4429395, "ns": 0, "title": "Eminem", "extract": "Marshall Bruce Mathers III (born October 17, 1972), known professionally as Eminem (; often stylized as EMINƎM), is an American rapper, songwriter, and record producer. Credited for popularizing hip hop to Middle America, Eminem's global success and acclaimed works is widely recognized for breaking racial barriers for the acceptance of white rappers in popular music. While much of his transgressive work during the early 2000s made him hugely controversial, he became a leading figure for representation of American underclass and reflected the angst of the millennials. He has been influential for many artists of various genres and is cited as one of the greatest rappers of all time.After his debut album Infinite (1996) and the extended play Slim Shady EP (1997), Eminem signed with Dr. Dre's Aftermath Entertainment and subsequently achieved mainstream popularity in 1999 with The Slim Shady LP. His next two releases The Marshall Mathers LP (2000) and The Eminem Show (2002) were worldwide successes and were both nominated for the Grammy Award for Album of the Year. After the release of what was considered to be his final album, Encore (2004), Eminem went on hiatus in 2005 partly due to a prescription drug addiction. He returned to the music industry four years later with the release of Relapse (2009), and Recovery was released the following year. Recovery was the best-selling album worldwide of 2010, making it Eminem's second album, after The Eminem Show in 2002, to be the best-selling album of the year worldwide. In the following years, he released the US number one albums The Marshall Mathers LP 2, Revival, Kamikaze and Music to Be Murdered By.\nEminem made his debut in the motion picture industry with the musical drama film film 8 Mile (2002), playing a fictionalized version of himself, which won the Academy Award for Best Original Song for \"Lose Yourself\", making him the first hip hop artist to ever win the award. He has made cameo appearances in the films The Wash (2001), Funny People (2009), and The Interview (2014), and the television series Entourage (2010). Eminem has developed other ventures, including Shady Records, with manager Paul Rosenberg, which helped launch the careers of artists such as 50 Cent, Yelawolf and Obie Trice, among others. He has also established his own channel, Shade 45, on Sirius XM Radio. In addition to his solo career, Eminem was a member of the hip hop group D12. He is also known for collaborations with fellow Detroit-based rapper Royce da 5'9\"; the two are collectively known as Bad Meets Evil.\nEminem is among the best-selling music artists of all time, with estimated worldwide sales of more than 220 million records. He was the best-selling music artist in the United States of the 2000s and the best-selling male music artist in the United States of the 2010s.  Billboard named him the \"Artist of the Decade (2000–2009)\". The Marshall Mathers LP, The Eminem Show, \"Lose Yourself\", \"Love the Way You Lie\" and \"Not Afraid\" have all been certified Diamond or higher by the Recording Industry Association of America (RIAA). Rolling Stone included him in its lists of the 100 Greatest Artists of All Time and the 100 Greatest Songwriters of All Time. He has won numerous awards, including 15 Grammy Awards, eight American Music Awards, 17 Billboard Music Awards, an Academy Award and a MTV Europe Music Global Icon Award.\nHe has had ten number one albums on the Billboard 200, which all consecutively debuted at number one on the chart making him the only artist to achieve this, and five number-one singles on the Billboard Hot 100."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "马绍尔·布鲁斯·马瑟斯三世", "details": ""}]}