{"id": "megadeth", "name": "Megadeth", "consensus_translation": "麦格戴斯", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 20653, "ns": 0, "title": "Megadeth", "extract": "Megadeth is an American heavy metal band formed in 1983 by guitarist Dave Mustaine and bassist David Ellefson in Los Angeles, California. Along with Metallica, Anthrax, and Slayer, Megadeth is one of the \"big four\" of American thrash metal, responsible for its development and popularization. Their music features complex arrangements and fast rhythm sections, and lyrical themes of death, war, politics, personal relationships and religion.\nIn 1985, Megadeth released its debut album, Killing Is My Business... and Business Is Good!, on the independent record label Combat Records, to moderate success. It caught the attention of bigger labels, which led to Megadeth signing with Capitol Records. Their first major-label album, Peace Sells... but Who's Buying?, was released in 1986 and was a major hit with the underground metal scene. Substance abuse and personal disputes brought Megadeth negative publicity during this period.\nAfter the lineup stabilized, Megadeth released a number of platinum-selling albums, including Rust in Peace (1990) and Countdown to Extinction (1992). These albums, along with worldwide tours, brought them public recognition. The band temporarily disbanded in 2002 when Mustaine suffered an arm injury and re-established in 2004 without bassist Ellefson, who had taken legal action against Mustaine. Ellefson settled out of court and rejoined in 2010. Megadeth has hosted its own music festival, Gigantour, several times since July 2005.\nMegadeth has sold 38 million records worldwide, earned platinum certification in the United States for six of its fifteen studio albums, and received twelve Grammy nominations. Megadeth won its first Grammy Award in 2017 for the song \"Dystopia\" in the Best Metal Performance category. The band's mascot, Vic Rattlehead, regularly appears on album artwork and live shows. The group has drawn controversy for its music and lyrics, including album bans and canceled concerts; MTV refused to play two of the band's music videos that the network considered to condone suicide."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "麦格戴斯", "details": ""}]}