{"id": "most known unknown", "name": "Most Known Unknown", "consensus_translation": "最著名的无名之辈", "category": "专辑", "alias": "", "group": "", "author": "Three 6 Mafia", "album": "", "date": "2005", "language": "en", "wikipedia": {"pageid": 4232617, "ns": 0, "title": "Most Known Unknown", "extract": "Most Known Unknown is the eighth studio album by American hip hop group Three 6 Mafia. It was released on September 27, 2005, by Hypnotize Minds, Sony Urban Music, and Columbia Records and is the follow-up to the 2003 album Da Unbreakables.This album is known for having some of Three 6 Mafia's biggest hits, including \"Stay Fly\" featuring Young Buck and 8Ball & MJG, \"Poppin' My Collar\" featuring Project Pat (though Pat's verse wasn't included in the first edition, but would later be included in the re-issue) and \"Side 2 Side\" featuring Bow Wow and Project Pat (with Bow Wow and Project Pat's verses, like the \"Poppin' My Collar\" remix, would not be used in the first edition, but would be released in the re-issue, along with another remix featuring Kanye West and a slightly different sounding melody). This album would prove to be their biggest success to date, topping the commercial success of their 2000 album When the Smoke Clears: Sixty 6, Sixty 1. The original version was released on a regular CD version as well as a DualDisc version. The re-release also had a bonus version, with two remixes of \"Poppin' My Collar\" and \"Side 2 Side\". A chopped and screwed version by Michael Watts was also released.\nAlong with chart topping hits, this album also featured several well-known guest rappers, including Mike Jones, Paul Wall, Slim Thug, Trick Daddy, Mr. Bigg, 8Ball & MJG, Young Buck, Remy Ma, Bow Wow (only on re-issue), Kanye West (only on re-issue), Lil' Flip, as well as the Hypnotize Camp Posse (Three 6 Mafia, Project Pat, Frayser Boy, Lil Wyte, and others).\nThree 6 Mafia member Lord Infamous was notably omitted from this album. Many rumors speculated that he either left the group or was kicked out; these rumors were put to rest when DJ Paul told sources that the reason for Infamous not being on the album was due to a stint in jail, leaving Crunchy Black, DJ Paul and Juicy J the only Three 6 Mafia members to be included on the album.\nMost Known Unknown opened at number 3 on the Billboard 200 and number 1 on the R&B/Hip-hop charts with 125,000 copies sold. It was certified gold by RIAA the week following its release on November 2, 2005, and reached platinum status by June 26, 2006."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "最著名的无名之辈", "details": ""}]}