{"id": "my beautiful dark twisted fantasy", "name": "My Beautiful Dark Twisted Fantasy", "consensus_translation": "我美丽黑暗扭曲的幻想", "category": "专辑", "alias": "", "group": "", "author": "Kanye West", "album": "", "date": "2010", "language": "en", "wikipedia": {"pageid": 26224454, "ns": 0, "title": "My Beautiful Dark Twisted Fantasy", "extract": "My Beautiful Dark Twisted Fantasy is the fifth studio album by American rapper and producer Kanye West. It was released on November 22, 2010, by Def Jam Recordings and Roc-A-Fella Records. It follows a period of public and legal controversy for West, who retreated to a self-imposed exile in Hawaii in 2009 and recorded at Honolulu's Avex Recording Studio in a communal environment involving numerous contributing musicians and producers. Additional recording sessions took place at Glenwood Place Studios in Burbank, California, and at Electric Lady Studios and Platinum Sound Recording Studios in New York City. \nThe album was produced primarily by West, along with a variety of high-profile producers such as Mike Dean, No I.D., Jeff Bhasker, RZA, S1, Bink, and DJ Frank E. Music journalists have noted the album features a maximalist aesthetic and opulent production quality with elements of West's previous works, including soul, baroque, electro, and symphonic styles, as well as progressive rock influences. Thematically, My Beautiful Dark Twisted Fantasy explores West's status as a celebrity, consumer culture, race, and the idealism of the American Dream. Guest vocalists on the album include Nicki Minaj, Bon Iver, Jay-Z, Pusha T, Rick Ross, Kid Cudi, John Legend, and Raekwon.\nTo help market the album, West released free songs through his GOOD Fridays weekly free music release series and four singles: \"Power\", \"Runaway\", \"Monster\", and \"All of the Lights\", which were all top 40 hits on the Billboard Hot 100. West also released a musical short film, Runaway (2010), set to music from the album. In its first week of release, My Beautiful Dark Twisted Fantasy debuted at number one on the US Billboard 200 and sold 496,000 copies, eventually reaching two million for a double platinum certification by the Recording Industry Association of America (RIAA). \nMy Beautiful Dark Twisted Fantasy was an immediate and widespread critical success, and was named the best album of 2010 in many publications' year-end lists, including the annual Pazz & Jop poll of American critics nationwide. The album also won Best Rap Album at the 2012 Grammy Awards but was not nominated for Album of the Year, which was viewed as a \"snub\" by several media outlets. The album's hit single \"All of the Lights\" won Best Rap Song and Best Rap/Sung Collaboration. Since widely considered West's best album, My Beautiful Dark Twisted Fantasy has ranked in several professionally curated lists as the best album of the 2010s and among the greatest of all time according to NME and Rolling Stone. George Condo's accompanying artwork – illustrating West straddled by an armless winged female (a phoenix) – has been ranked among the greatest album covers."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "我美丽黑暗扭曲的幻想", "details": ""}]}