{"id": "newcleus", "name": "Newcleus", "consensus_translation": "核新", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 327422, "ns": 0, "title": "Newcleus", "extract": "Newcleus was an American electro and old school hip hop group that gained popularity in the early 1980s. The group is primarily known for its 12-inch single \"Jam-On's Revenge\" (re-released as \"Jam on Revenge (The Wikki-Wikki Song)\" (1983)) and \"Jam on It\" (1984), which began as an anti-rap joke, according to founding member DJ and producer Ben Cenac. At the time (1981) we were going by the name Positive Messenger and were making music that had a purpose, either messages of love or faith or talking about the conditions of the world. However, we were still doing lots of Hip-Hop jams with our DJ crew Jam-On Productions. So, one of our DJs, Salvador Smooth, kept nagging me to do a Rap song. Having come out of Hip-Hop street battles in Brooklyn in the ’70s, I didn't really think much of the Rap records that were playing on the radio, so I figured as a joke I would make a parody jam ... I threw in an idea from an [event] that actually had happened in the ’70s, when a DJ who we had just blown out in a battle said to me \"Yeah, you guys are bad, but you can't do this… wikki wikki wikki wikki,\" meaning how we didn't scratch on the turntables. I used to play \"Jam-On's Revenge\" at our parties and it would fill the dance floor, so even though I had never planned to release it, when I was shopping Positive Messenger for a deal I put it on the tape just to fill out space at the end. Turned out it ended up being the track that drove everybody crazy! So, we went with it and changed our names to Newcleus.\" The group was based in the Bedford-Stuyvesant neighborhood of Brooklyn, New York. Their appearance overlapped with the formative years of hip-hop DJing in the Bronx.The beat from their 1984-song \"Automan\" was sampled by euro-dance project  \"Snap!\" for their 1992-release \"Rhythm is a Dancer\" which featured lyrics written and performed by American singer and songwriter Thea Austin as well as rap vocals by American rapper Turbo B and became a major international hit."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "核新", "details": ""}]}