{"id": "nothing on you", "name": "Nothing on You", "consensus_translation": "你无与伦比", "category": "歌曲", "alias": "", "group": "", "author": "B.o.B", "album": "", "date": "2010", "language": "en", "wikipedia": {"pageid": 26095723, "ns": 0, "title": "Nothin' on You", "extract": "\"Nothin' on You\" is the debut single by American rapper B.o.B from his debut studio album, B.o.B Presents: The Adventures of Bobby Ray. He co-wrote the track with its producers Bruno Mars, Philip Lawrence, and Ari Levine of The Smeezingtons. Mars also contributes additional vocals to the song. It was first released on December 15, 2009 via digital download by Atlantic Records. \"Nothin' on You\" was initially written for Lupe Fiasco, but Atlantic Records' chairman, Craig Kallman, gave the song to B.o.B after being displeased with Fiasco's version. The song took several months to finish and was born from a hummed melody by Mars and Lawrence.\n\"Nothin' on You\" is an R&B and Southern hip hop ballad. Some music critics praised its sweetness and positive vibe, while a few criticized the track due to Mars' performance. The song's main structure relies on a Jim Jonsin-helmed-beat and a sample of Joe Tex's \"I Gotcha\". Lyrically, the record aims at a woman's heart by flattering and showing her she is unique. The single reached the number one position in some countries, including the United States and the United Kingdom, the third and fifth spot in Australia and New Zealand, respectively, and the top ten in Canada. It was certified triple platinum by the Recording Industry Association of America (RIAA) and once by Australian Recording Industry Association (ARIA) and Music Canada (MC).\nThe music video, directed by Ethan Lader, with animation done by George Rausch, was filmed in Los Angeles. It features cutout animation, which takes multiple collages and taps them one over each other, in this case depicting various women. The video is interpolated with footage of the performers playing instruments along with Lawrence. The track has been covered by various recording artists and parodied by \"Weird Al\" Yankovic. It was nominated for Record of the Year, Best Rap Song and Best Rap/Sung Collaboration at the 53rd Grammy Awards. The song was performed live at The Ellen DeGeneres Show and at the 2010 MTV Video Music Awards. Both artists have promoted it during their respective tours."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "你无与伦比", "details": ""}]}