{"id": "only built 4 cuban linx…", "name": "Only Built 4 Cuban Linx…", "consensus_translation": "只给戴古巴金链的弟兄们", "category": "专辑", "alias": "", "group": "", "author": "Raekwon", "album": "", "date": "1995", "language": "en", "wikipedia": {"pageid": 47449131, "ns": 0, "title": "Only Built 4 Cuban Linx...", "extract": "Only Built 4 Cuban Linx... is the debut studio album by American rapper and Wu-Tang Clan member Raekwon, released on August 1, 1995, by Loud Records and RCA Records. The album was loosely composed to play like a film with Raekwon as the \"star,\" fellow Wu-Tang member Ghostface Killah as the \"guest-star,\" and producer RZA as the \"director.\" It features appearances from every member of the Wu-Tang Clan except for Old Dirty Bastard. The album also features debut appearances for  affiliates Cappadonna and Blue Raspberry. It also features an acclaimed guest appearance from rapper Nas, which marked the first collaboration with a non-affiliated artist on a Wu-Tang related album.\nUpon its release, Only Built 4 Cuban Linx... debuted at number four on the Billboard 200 chart, and number two on the Top R&B/Hip-Hop Albums chart, while selling 130,000 copies in its opening week. The album was certified gold by the Recording Industry Association of America (RIAA) on October 2, 1995, and according to Nielsen Soundscan, it has sold 1.1 million copies in the United States alone. Although it failed to acquire the same initial sales success as previous Wu-Tang solo albums, Cuban Linx achieved greater critical praise, with many complimenting its cinematic lyricism and production.\nOnly Built 4 Cuban Linx... has received acclaim from music critics and writers over the years, with many lauding it as one of the greatest hip hop albums of all time. With its emphasis on American Mafia insinuations and organized crime, the album is widely regarded as a pioneer of the mafioso rap subgenre. It is considered to have been highly influential on hip hop music over the next decade, being heavily referenced and influential on acclaimed albums such as Jay-Z's Reasonable Doubt (1996) and The Notorious B.I.G.'s Life After Death (1997). Along with GZA's Liquid Swords, Cuban Linx is the most acclaimed solo Wu-Tang work. In 2012, Rolling Stone magazine placed it at number 480 on their 500 Greatest Albums of All Time list."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "只给戴古巴金链的弟兄们", "details": "只给懂真正的黑人哥们儿，加了注释"}]}