{"id": "otis redding", "name": "Otis Redding", "consensus_translation": "奥蒂斯·雷丁", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 32817065, "ns": 0, "title": "Otis Redding", "extract": "Otis Ray Redding Jr. (September 9, 1941 – December 10, 1967) was an American singer, songwriter, record producer, arranger, and talent scout. He is considered one of the greatest singers in the history of American popular music and a seminal artist in soul music and rhythm and blues. Redding's style of singing gained inspiration from the gospel music that preceded the genre. His singing style influenced many other soul artists of the 1960s.\nRedding was born in Dawson, Georgia, and at the age of 2, moved to Macon, Georgia. Redding quit school at age 15 to support his family, working with Little Richard's backing band, the Upsetters, and by performing in talent shows at the historic Douglass Theatre in Macon. In 1958, he joined Johnny Jenkins's band, the Pinetoppers, with whom he toured the Southern states as a singer and driver. An unscheduled appearance on a Stax recording session led to a contract and his first single, \"These Arms of Mine\", in 1962.\nStax released Redding's debut album, Pain in My Heart, two years later. Initially popular mainly with African-Americans, Redding later reached a wider American pop music audience. Along with his group, he first played small shows in the American South. He later performed at the popular Los Angeles night club Whisky a Go Go and toured Europe, performing in London, Paris and other major cities. He also performed at the Monterey Pop Festival in 1967.\nShortly before his death in a plane crash, Redding wrote and recorded his iconic \"(Sittin' On) The Dock of the Bay\" with Steve Cropper. The song became the first posthumous number-one record on both the Billboard Hot 100 and R&B charts. The album The Dock of the Bay was the first posthumous album to reach number one on the UK Albums Chart. Redding's premature death devastated Stax. Already on the verge of bankruptcy, the label soon discovered that the Atco division of Atlantic Records owned the rights to his entire song catalog.\nRedding received many posthumous accolades, including two Grammy Awards, the Grammy Lifetime Achievement Award and induction into the Rock and Roll Hall of Fame and the Songwriters Hall of Fame. In addition to \"(Sittin' On) The Dock of the Bay,\" \"Respect\" and \"Try a Little Tenderness\" are among his best-known songs.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "奥蒂斯·雷丁", "details": ""}]}