{"id": "pet sounds", "name": "Pet Sounds", "consensus_translation": "宠物之声", "category": "专辑", "alias": "", "group": "", "author": "The Beach Boys", "album": "", "date": "1966", "language": "en", "wikipedia": {"pageid": 146002, "ns": 0, "title": "Pet Sounds", "extract": "Pet Sounds is the eleventh studio album by the American rock band the Beach Boys, released May 16, 1966 on Capitol Records. It initially met with a lukewarm critical and commercial response in the United States, peaking at number 10 on Billboard Top LPs chart, lower than the band's preceding albums. In the United Kingdom, the album was hailed by critics and peaked at number 2 in the UK Top 40 Albums Chart, remaining among the top ten positions for six months. Promoted as \"the most progressive pop album ever\", Pet Sounds attracted recognition for its ambitious recording and sophisticated music. It is widely considered to be among the most influential albums in the history of music.The album was produced, arranged, and almost entirely composed by Brian Wilson with guest lyricist Tony Asher. It was mostly recorded between January and April 1966, a year after Wilson quit touring with his bandmates. His goal was to create \"the greatest rock album ever made\"—a cohesive work with no filler tracks. It is sometimes considered a Wilson solo album and a refinement of the themes and ideas he introduced with The Beach Boys Today! (1965). Lead single \"Caroline, No\" was issued as his official solo debut. It was followed by two singles credited to the group: \"Sloop John B\" and \"Wouldn't It Be Nice\" (backed with \"God Only Knows\").\nWilson's Wall of Sound-based orchestrations mixed conventional rock set-ups with elaborate layers of vocal harmonies, found sounds, and instruments never before associated with rock, such as bicycle bells, French horn, flutes, Electro-Theremin, string sections, and beverage cans. The album consists mainly of introspective songs like \"I Know There's an Answer\", a critique of LSD users, and \"I Just Wasn't Made for These Times\", the first use of a theremin-like instrument on a rock record. Its unprecedented total production cost exceeded $70,000 (equivalent to $550,000 in 2019). In October, the leftover song \"Good Vibrations\" followed as a single and became a worldwide hit. In 1997, a \"making-of\" version of Pet Sounds was overseen by Wilson and released as The Pet Sounds Sessions, containing the album's first true stereo mix.\nPet Sounds is regarded by musicologists as an early concept album that advanced the field of music production, introducing non-standard harmonies and timbres, and incorporating elements of pop, jazz, exotica, classical, and the avant-garde. The album could not be replicated live and was the first time a group departed from the usual small-ensemble electric rock band format for a whole LP. Combined with its innovative music, which was perceived as a wholly self-conscious artistic statement (or \"concept\"), the record furthered the cultural legitimization of popular music, was crucial to the development of progressive/art rock, and helped bring psychedelic music to the mainstream. In 2003 and 2012, Rolling Stone ranked Pet Sounds second on its lists of the greatest albums of all time. In 2004, it was preserved in the National Recording Registry by the Library of Congress for being \"culturally, historically, or aesthetically significant.\""}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "宠物之声", "details": ""}]}