{"id": "pink friday", "name": "Pink Friday", "consensus_translation": "粉红星期五", "category": "专辑", "alias": "", "group": "", "author": "Nicki Minaj", "album": "", "date": "2010", "language": "en", "wikipedia": {"pageid": 28253219, "ns": 0, "title": "Pink Friday", "extract": "Pink Friday is the debut studio album by Trinidadian-American rapper Nicki Minaj. It was released on November 22, 2010 by Young Money, Cash Money and Universal Motown. After signing a recording contract with Young Money Entertainment in 2009, Minaj began planning the album that same year and work continued into 2010. Minaj enlisted a variety of producers whose efforts resulted in a primarily hip hop record, which sees additional influences from R&B and pop music. The album features guest vocals from Eminem, Rihanna, Drake, will.i.am, Kanye West and Natasha Bedingfield.\nThe album was promoted with eight singles, including the internationally successful single \"Super Bass\", and US Billboard Hot 100 top 40 singles \"Your Love\", \"Check It Out\", \"Right Thru Me\", \"Moment 4 Life\", and \"Fly\". Minaj also supported the album with a five-date promotional concert tour during October 2010.\nAfter a much anticipated release as the result of Minaj's extensive featured appearances on the singles of other artists, Pink Friday debuted at number two on the US Billboard 200, selling 375,000 copies in its first week. It ultimately reached number one on the chart and also charted within the top 20 in Australia, Canada, and the United Kingdom. As of February 2018, the album has sold two million traditional copies in the United States. The album has been certified 3× platinum by the Recording Industry Association of America (RIAA) for combined album sales, track sales, and song streams equivalent of three million album-sale units. Pink Friday was nominated for Best Rap Album at the 54th Grammy Awards in 2012, alongside Minaj's other nominations for Best New Artist and Best Rap Performance for the single \"Moment 4 Life\"."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "粉红星期五", "details": ""}]}