{"id": "pitbull", "name": "Pitbull", "consensus_translation": "斗牛梗", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 64235, "ns": 0, "title": "Pit bull", "extract": "Pit bull is the common name for a type of dog descended from bulldogs and terriers. The pit bull-type is particularly ambiguous, as it encompasses a range of pedigree breeds, informal types and appearances that cannot be reliably identified. Formal breeds often considered to be of the pit bull-type include the American Pit Bull Terrier, American Staffordshire Terrier, American Bully, and Staffordshire Bull Terrier. The American Bulldog is also sometimes included. Mixed-breed dogs which physically resemble these breeds often get labelled as \"pit bulls\" by shelters. Many of these breeds were originally developed as fighting dogs from crossbreeding bull-baiting dogs (used to hold the faces and heads of larger animals such as bulls) and terriers. After the use of dogs in blood sports was banned, such dogs were used as catch dogs in the United States for semi-wild cattle and hogs, to hunt and drive livestock, and as family companions. Despite dog fighting now being illegal in the United States, it still exists as an underground activity, and pit bulls are a common type used.According to the American Veterinary Medical Association, \"owners of pit bull-type dogs deal with a strong breed stigma; however, controlled studies have not identified this breed group as disproportionately dangerous.\" Because owners of stigmatized breeds are more likely to have involvement in criminal or violent acts, breed correlations may have the owner's behavior as the underlying causal factor. Some jurisdictions have enacted legislation banning the group of breeds, and some insurance companies do not cover liability from pit bull bites. Among other roles, pit bulls have served as police dogs, search and rescue dogs, and several have appeared on film.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "斗牛梗", "details": ""}]}