{"id": "quincy jones", "name": "Quincy Jones", "consensus_translation": "昆西·琼斯", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 205508, "ns": 0, "title": "Quincy Jones", "extract": "Quincy Delight Jones Jr. (born March 14, 1933) is an American record producer, multi-instrumentalist, songwriter, composer, arranger, and film and television producer. His career spans over 60 years in the entertainment industry with a record 80 Grammy Award nominations, 28 Grammys, and a Grammy Legend Award in 1992.\nJones came to prominence in the 1950s as a jazz arranger and conductor, before moving on to work in pop music and film scores. In 1968 Jones and his songwriting partner Bob Russell became the first African-Americans to be nominated for an Academy Award for Best Original Song, for \"The Eyes of Love\" from the film Banning. Jones was also nominated for an Academy Award for Best Original Score for his work on the 1967 film In Cold Blood, making him the first African-American to be nominated twice in the same year. In 1971 he became the first African-American to be the musical director and conductor of the Academy Awards ceremony. In 1995 he was the first African-American to receive the Academy's Jean Hersholt Humanitarian Award. He has tied with sound designer Willie D. Burton as the second most Oscar-nominated African-American, with seven nominations each.\nJones was the producer, with Michael Jackson, of Jackson's albums Off the Wall (1979), Thriller (1982), and Bad (1987), as well as the producer and conductor of the 1985 charity song \"We Are the World\", which raised funds for victims of famine in Ethiopia. In 2013, Jones was inducted into the Rock & Roll Hall of Fame as the winner, alongside Lou Adler, of the Ahmet Ertegun Award. He was named one of the most influential jazz musicians of the 20th century by Time magazine."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "昆西·琼斯", "details": ""}]}