{"id": "rapture", "name": "Rapture", "consensus_translation": "狂喜", "category": "歌", "alias": "", "group": "", "author": "Blondie", "album": "", "date": "1981", "language": "en", "wikipedia": {"pageid": 66196, "ns": 0, "title": "Rapture", "extract": "The rapture is an eschatological concept of a minority of Christians, particularly within branches of American evangelicalism, consisting of an end-time event when all Christian believers who are alive, along with resurrected believers, will rise \"in the clouds, to meet the Lord in the air.\"In Paul the Apostle's First Epistle to the Thessalonians in the Bible, he uses the Greek word harpazo (Ancient Greek: ἁρπάζω), meaning \"to snatch away\" or \"to seize,\" and explains that believers in Jesus Christ will be snatched away from earth into the air. The term is most frequently used among conservative Christian theologians in the United States. Rapture has also been used for a mystical union with God or for eternal life in Heaven.Differing viewpoints exist about the exact timing of the rapture and whether Christ's return will occur in one event or two. Pretribulationism distinguishes the rapture from the second coming of Jesus Christ to earth, mentioned in the Gospel of Matthew, 2 Thessalonians, and Revelation. This view holds that the rapture will precede the seven-year Tribulation, which will culminate in Christ's second coming and be followed by a thousand-year Messianic Kingdom. Adherents of this perspective are referred to as premillennial dispensationalists. This theory grew out of the translations of the Bible that John Nelson Darby analyzed in 1833. Pretribulationism is the most widely held view in America today, although this view is disputed within evangelicalism.There are also differing views among Christians regarding the aerial gathering described in 1 Thessalonians 4. The majority of broadly Christian and mainline churches do not subscribe to pretribulational views. Catholics, Eastern Orthodox, Anglicans, Episcopalians, Lutherans, Presbyterians,  United Methodists, the United Church of Christ, and most Reformed Christians do not generally use rapture as a specific theological term, nor do they generally subscribe to the premillennial dispensational views associated with its use. Instead these groups typically interpret rapture in the sense of the elect gathering with Christ in Heaven after His second coming and reject the idea that a large segment of humanity will be left behind on earth for an extended tribulation period after the events of 1 Thessalonians 4:17."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "狂喜", "details": ""}]}