{"id": "ready to die", "name": "Ready to Die", "consensus_translation": "准备受死", "category": "专辑", "alias": "", "group": "", "author": "The Notorious B.I.G.", "album": "", "date": "1994", "language": "en", "wikipedia": {"pageid": 47768999, "ns": 0, "title": "Ready to Die", "extract": "Ready to Die is the debut studio album by American rapper The Notorious B.I.G., released on September 13, 1994, by Bad Boy and Arista Records. The album features production by Bad Boy founder Sean \"Puffy\" Combs, Easy Mo Bee, Chucky Thompson, DJ Premier, and Lord Finesse, among others. It was recorded from 1993 to 1994 at The Hit Factory and D&D Studios in New York City. The partly autobiographical album tells the story of the rapper's experiences as a young criminal, and was the only studio album released during his lifetime, as he was murdered sixteen days before the release of his second album Life After Death in 1997.\nReady to Die peaked at number 15 on the Billboard 200 and was subject to critical acclaim and soon a commercial success. Three singles were released from the album: \"Juicy\", \"Big Poppa\", \"One More Chance\" and a promotional track of Biggie: \"Warning\". \"Juicy\", the lead single, peaked at number 27 on the Billboard Hot 100, number 14 on Hot R&B/Hip-Hop Singles & Tracks and reached number 3 on the Hot Rap Singles. \"Big Poppa\" was a hit on multiple charts, peaking at number six on the Billboard Hot 100 and also being nominated for a Grammy Award for Best Rap Solo Performance at the 1996 Grammy Awards. The Notorious B.I.G.'s lyrics on the album were generally praised by critics, with many praising his story-telling ability.\nIn April 2018, Ready to Die was certified 6 × Platinum by the Recording Industry Association of America (RIAA). The album was significant for revitalizing the East Coast hip hop scene, amid West Coast hip hop's commercial dominance, and has been ranked by many critics as one of the greatest hip hop albums, as well as one of the greatest albums of all time. Rolling Stone ranked it number 134 on its list of the 500 Greatest Albums of All Time. Time included it on its list of the All-TIME 100 Albums."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "准备受死", "details": ""}]}