{"id": "revolver", "name": "Revolver", "consensus_translation": "左轮手枪", "category": "专辑", "alias": "", "group": "", "author": "The Beatles", "album": "", "date": "1996", "language": "en", "wikipedia": {"pageid": 25794, "ns": 0, "title": "Revolver", "extract": "A revolver (also called a wheel gun) is a repeating handgun that has a revolving cylinder containing multiple chambers (each holding a single cartridge) and at least one barrel for firing.  Before firing a round, the hammer is cocked and the cylinder rotates partially, indexing one of the cylinder chambers into alignment with the barrel, which allows the bullet to be fired through the bore.  The hammer cocking can be achieved by either the user manually pulling the hammer back (as in single-action), via internal linkage relaying a rearward movement of the trigger (as in double-action), or both (as in double/single-action).  By sequentially rotating through each chamber, the revolver allows the user to fire multiple times until having to reload the gun, unlike older single-shot firearms that had to be reloaded after each shot.\nAlthough largely surpassed in convenience and ammunition capacity by semi-automatic pistols, revolvers still remain popular as back-up and off-duty handguns among American law enforcement officers and security guards and are still common in the American private sector as defensive and sporting/hunting firearms. Famous revolvers models include the Colt 1851 Navy Revolver, the Webley, the Colt Single Action Army, the Colt Official Police, Smith & Wesson Model 10, the Smith & Wesson Model 29 of Dirty Harry fame, the Nagant M1895, and the Colt Python.\nThough the majority of weapons using a revolver mechanism are handguns, other firearms may also have a revolver action. These include some models of grenade launchers, shotguns, rifles and cannons. Revolver weapons differ from Gatling-style rotary weapons in that in a revolver only the chambers rotate, while in a rotary weapon there are multiple full firearm actions with their own barrels which rotate around a common ammunition feed."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "左轮手枪", "details": ""}]}