{"id": "rudolph the red-nosed reindeer", "name": "Rudolph the Red-Nosed Reindeer", "consensus_translation": "红鼻子驯鹿鲁道夫", "category": "歌曲", "alias": "", "group": "", "author": "", "album": "《A Christmas Gift for You from Phil Spector》", "date": "1963", "language": "en", "wikipedia": {"pageid": 157222, "ns": 0, "title": "Rudolph the Red-Nosed Reindeer", "extract": "Rudolph the Red-Nosed Reindeer is a fictional reindeer created by Robert Lewis May. Rudolph is usually depicted as the ninth and youngest of Santa Claus's reindeer, using his luminous red nose to lead the reindeer team and guide Santa's sleigh on Christmas Eve for only one year. Though he initially receives ridicule for his nose as a fawn, the brightness of his nose is so powerful that it illuminates the team's path through harsh winter weather.  Ronald D. Lankford, Jr., described Rudolph's story as \"the fantasy story made to order for American children: each child has the need to express and receive approval for his or her individuality and/or special qualities. Rudolph's story embodies the American Dream for the child, written large because of the cultural significance of Christmas.\"Rudolph first appeared in a 1939 booklet written by Robert L. May and published by Montgomery Ward, the department store.The story is owned by The Rudolph Company, LP and has been adapted and shaped in numerous forms including a popular song by Johnny Marks, the iconic 1964 stop-motion animated television special and its two sequels from Rankin/Bass Productions, as well as the 1998 traditional animated feature film and a 2001 CGI sequel from GoodTimes Entertainment. Character Arts, LLC manages the licensing for the Rudolph Company, LP.  In many countries, Rudolph has become a figure of Christmas folklore. 2014 marked the 75th anniversary of the character and the 50th anniversary of the Rankin/Bass television special. A series of postage stamps featuring Rudolph was issued by the United States Postal Service on November 6, 2014."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "红鼻子驯鹿鲁道夫", "details": ""}]}