{"id": "sex pistols", "name": "Sex Pistols", "consensus_translation": "性手枪", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 30320, "ns": 0, "title": "Sex Pistols", "extract": "The Sex Pistols were an English punk rock band that formed in London in 1975. They were responsible for initiating the punk movement in the United Kingdom and inspiring many later punk and alternative rock musicians. Although their initial career lasted just two and a half years and produced only four singles and one studio album, Never Mind the Bollocks, Here's the Sex Pistols, they are regarded as one of the most influential acts in the history of popular music.The Sex Pistols originally comprised vocalist Johnny Rotten (John Lydon), guitarist Steve Jones, drummer Paul Cook and bassist Glen Matlock. Matlock was replaced by Sid Vicious in early 1977. Under the management of Malcolm McLaren, the band attracted controversies that both captivated and appalled Britain. Through an obscenity-laced television interview in December 1976 and their May 1977 single \"God Save the Queen\", attacking Britons' social conformity and deference to the Crown, they precipitated the punk rock movement.\nIn January 1978, at the end of an over-hyped and turbulent tour of the United States, Rotten announced the band's break-up. Over the next few months, the three remaining band members recorded songs for McLaren's film version of the Sex Pistols' story, The Great Rock 'n' Roll Swindle. Vicious died of a heroin overdose in February 1979, following his arrest for the alleged murder of his girlfriend.\nRotten, Jones, Cook and Matlock briefly reunited for a concert tour in 1996. On 24 February 2006, the Sex Pistols—the four original members plus Vicious—were inducted into the Rock and Roll Hall of Fame, but they refused to attend the ceremony, calling the museum \"a piss stain\".\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "性手枪", "details": ""}]}