{"id": "slayer", "name": "Slayer", "consensus_translation": "杀手", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 73575, "ns": 0, "title": "Slayer", "extract": "Slayer was an American thrash metal band from Huntington Park, California. The band was formed in 1981 by guitarists Kerry King and Jeff Hanneman, drummer Dave Lombardo, and bassist and vocalist Tom Araya. Slayer's fast and aggressive musical style made them one of the founding \"big four\" bands of thrash metal, alongside Metallica, Megadeth and Anthrax. Slayer's final lineup comprised King, Araya, drummer Paul Bostaph and guitarist Gary Holt. Drummer Jon Dette was also a member of the band.\nIn the original lineup, King, Hanneman and Araya contributed to the band's lyrics, and all of the band's music was written by King and Hanneman. The band's lyrics and album art, which cover topics such as murder, serial killers, torture, genocide, politics, human experimentation, Satanism, hate crimes, terrorism, religion, antireligion, Nazism, racism, war and prison, have generated album bans, delays, lawsuits and criticism from religious groups and factions of the general public. However, its music has been highly influential, often being cited by many bands as an influence musically, visually and lyrically; the band's third album, Reign in Blood (1986), has been described as one of the heaviest and most influential thrash metal albums.\nSlayer released twelve studio albums, two live albums, a box set, six music videos, two extended plays and a cover album. Four of the band's studio albums have received gold certification in the United States. The band has received five Grammy Award nominations, winning one in 2007 for the song \"Eyes of the Insane\" and one in 2008 for the song \"Final Six\", both of which were from the album Christ Illusion (2006). Between 1991 and 2013, the band sold five million albums in the United States. After more than three decades of recording and performing, Slayer announced in January 2018 that it would embark on its final world tour, which took place from May 2018 to November 2019, and the band subsequently disbanded."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "杀手", "details": ""}]}