{"id": "sly and the family stone", "name": "Sly and the Family Stone", "consensus_translation": "斯莱和斯通一家", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 165878, "ns": 0, "title": "Sly and the Family Stone", "extract": "Sly and the Family Stone was an American band from San Francisco. Active from 1966 to 1983, it was pivotal in the development of funk, soul, rock, and psychedelic music. Its core line-up was led by singer-songwriter, record producer, and multi-instrumentalist Sly Stone, and included Stone's brother and singer/guitarist Freddie Stone, sister and singer/keyboardist Rose Stone, trumpeter Cynthia Robinson, drummer Greg Errico, saxophonist Jerry Martini, and bassist Larry Graham. It was the first major American rock group to have a racially integrated, male and female lineup.Formed in 1966, the group's music synthesized a variety of disparate musical genres to help pioneer the emerging \"psychedelic soul\" sound. They released a series of Top 10 Billboard Hot 100 hits such as \"Dance to the Music\" (1968), \"Everyday People\" (1968), and \"Thank You (Falettinme Be Mice Elf Agin)\" (1969), as well as critically acclaimed albums such as Stand! (1969), which combined pop sensibility with social commentary. In the 1970s, it transitioned into a darker and less commercial funk sound on releases such as There's a Riot Goin' On (1971) and Fresh (1973), proving as influential as their early work. By 1975, drug problems and interpersonal clashes led to dissolution, though Sly continued to record and tour with a new rotating lineup under the name \"Sly and the Family Stone\" until drug problems forced his effective retirement in 1987.The work of Sly and the Family Stone greatly influenced the sound of subsequent American funk, pop, soul, R&B, and hip hop music. Music critic Joel Selvin wrote, \"there are two types of black music: black music before Sly Stone, and black music after Sly Stone\". In 2010, they were ranked 43rd in Rolling Stone's 100 Greatest Artists of All Time, and three of their albums are included on Rolling Stone's 500 Greatest Albums of All Time. The band was inducted into the Rock and Roll Hall of Fame in 1993."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "斯莱和斯通一家", "details": ""}]}