{"id": "southern all stars", "name": "Southern All Stars", "consensus_translation": "南天群星", "category": "乐队", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 483152, "ns": 0, "title": "Southern All Stars", "extract": "Southern All Stars (サザンオールスターズ, Sazan Ōrusutaazu), also known by the abbreviations Sazan (サザン) and SAS, are a Japanese rock band that first formed in 1974.\nThe band is composed of Keisuke Kuwata (lead vocals and guitars), Yuko Hara (vocals and keyboards), Kazuyuki Sekiguchi (bass), Hiroshi Matsuda (drums) and Hideyuki \"Kegani\" Nozawa (percussion). In addition to the present lineup, former guitarist Takashi Omori had worked in the band until 2001.After the contract with Victor Entertainment, the band released their top-ten charting debut single \"Katte ni Sindbad\" in 1978. Since then, Southern has been one of the best-selling music groups in the past 30 years of Japan, selling more than 47 million albums and singles in Japan alone. They have had over 40 top-ten hit singles and 16 number-one albums on the Japan's Oricon Charts as of 2008.Their 1998 compilation Umi no Yeah!! has sold more than 3.3 million copies and became the best-selling double album in Japanese history. Their most commercially successful song \"Tsunami\", released in 2000, has sold over 2.9 million units in Japan alone, and provided the band with honor of winning the 42nd Japan Record Awards. The band was also acclaimed and ranked number one in HMV Japan's 2003 list of \"100 most influential Japanese musicians\". In 2007, Rolling Stone Japan ranked their album Ninkimono de Ikō number 32 on a list of the greatest Japanese rock albums of all time. They are also the only group to ever have 44 songs on the Oricon Top 100 weekly single chart simultaneously.The band has occasionally gone into hiatus while individual members work on solo and other projects, and did so again between 2008 and 2013.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "南天群星", "details": ""}]}