{"id": "speakerboxxx", "name": "Speakerboxxx", "consensus_translation": "扬声器/爱于其下", "category": "专辑", "alias": "", "group": "", "author": "Outkast", "album": "", "date": "2003", "language": "en", "wikipedia": {"pageid": 504875, "ns": 0, "title": "Speakerboxxx/The Love Below", "extract": "Speakerboxxx/The Love Below is the fifth studio album by American hip hop duo Outkast. It was released on September 23, 2003, by LaFace Records. Issued as a double album, its playtime of more than two hours is distributed over solo albums from both of the group's members. Big Boi's Speakerboxxx is a Southern hip hop album with a P-Funk influence, while André 3000's The Love Below features psychedelic, pop, funk, electro, and jazz styles.Speakerboxxx demonstrated more social awareness than its counterpart, with themes of family, philosophy, religion, politics and \"a wider emotional terrain ... from melancholy to outrage to expression.\" Following the release of Outkast's fourth studio album Stankonia (2000), André 3000 felt urged to do something different from his previous projects; the result was to feature live instruments and sing instead of rap. The Love Below was identified as far more musically experimental, comparable to the music of Prince.\nSpeakerboxxx/The Love Below was supported with the hit singles \"Hey Ya!\" and \"The Way You Move\", which both reached number one on the US Billboard Hot 100, and the top ten hit \"Roses\". The album debuted at number one on the Billboard 200 with sales of 510,000 copies in its first week. It eventually amassed a total of seven non-consecutive weeks at the top of the chart and 24 weeks in the Top 10. It has been certified diamond and 11 times platinum by the RIAA (each disc in the double album counted as a separate unit for certification). As of March 2012, it has shipped 5.7 million units in the United StatesSpeakerboxxx/The Love Below received widespread acclaim from music critics, who praised the consistency of Big Boi's Speakerboxxx and the eclectic musical style of André 3000's The Love Below. It topped The Village Voice's Pazz & Jop critics poll, and won Album of the Year and Best Rap Album at the 46th Grammy Awards, while \"Hey Ya!\" won Best Urban/Alternative Performance."}, "opinions": [{"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "扬声器/爱于其下", "details": ""}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "大喇叭/爱乱来", "details": ""}]}