{"id": "straight outta compton", "name": "Straight Outta Compton", "consensus_translation": "冲出康普顿", "category": "专辑", "alias": "", "group": "", "author": "N.W.A", "album": "", "date": "1988", "language": "en", "wikipedia": {"pageid": 194627, "ns": 0, "title": "Straight Outta Compton", "extract": "Straight Outta Compton is the debut studio album by the rap group N.W.A, formed in Los Angeles county's City of Compton. Released on August 8, 1988, by Ruthless Records, founded by N.W.A leader Eazy-E, the album was produced by N.W.A's Dr. Dre, DJ Yella, and Arabian Prince, with lyrics written by N.W.A's Ice Cube and MC Ren with Ruthless rapper The D.O.C. The track \"Fuck tha Police\" drew an FBI agent's warning letter, which aided N.W.A's notoriety and led to the group calling itself \"the world's most dangerous group.\"Despite scarce radio play beyond the Los Angeles area, the album delivered gangsta rap's first platinum certification, one million copies sold, in July 1989. That year, the album peaked at #9 on Billboard's Top R&B/Hip-Hop Albums chart, and at #37 on the pop albums chart, the Billboard 200. Enjoying media spotlight, N.W.A's example triggered the rap genre's movement toward hardcore, gangsta rap. As the 1990s closed, if largely through N.W.A's own splintering—yielding successful solo music careers and franchises for Ice Cube and for Dr. Dre, whose 1991 departure dissolved the group—N.W.A's ripple effects had reshaped rap, R&B, and pop music, influencing pop culture.Remastered, the album's September 2002 reissue gained four bonus tracks. The next year, Rolling Stone, ranking the 500 Greatest Albums of All Time, ranked this album 144th—while fifth among rap albums—an overall spot held in the list's 2012 update. Nearing the album's 20th anniversary, an extended version of it arrived in December 2007. And in 2015, after an album reissue on red cassettes of limited edition, the biopic film Straight Outta Compton reinvigorated album sales, which by year's end were triple-platinum. In 2016, it became the first rap album into the Grammy Hall of Fame. The next year, the Library of Congress enshrined Straight Outta Compton in the National Recording Registry."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "冲出康普顿", "details": ""}]}