{"id": "suge knight", "name": "Suge Knight", "consensus_translation": "苏格·奈特", "category": "实业家", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 161482, "ns": 0, "title": "Suge Knight", "extract": "Marion Hugh \"Suge\" Knight Jr. (; born April 19, 1965) is an American former music executive who, as cofounder and CEO of Death Row Records, was a central figure in gangsta rap's catapult to massive commercialization. This feat is attributed to the record label's first two album releases: Dr. Dre's The Chronic in 1992 and Snoop Dogg's Doggystyle in 1993. \"It was Knight’s executive muscle that helped Snoop\"—implicated in a 1993 homicide—\"avoid jail a few years after its release\".During 1995, Tupac Shakur began a prison sentence of up to four and half years. Knight struck a deal with him that in October, paying his bail, freed him from prison—pending his conviction's appeal—while signing him to Deathrow Records. In 1996, the label released 2Pac's greatest commercial success, All Eyez on Me. Yet that September, after departing a Mike Tyson boxing match in Las Vegas, a group that included Knight and Shakur assaulted Orlando Anderson, a Southside Compton Crips gang member. Three hours later someone shot into the car that Knight was driving and fatally wounded Shakur, and Anderson has since become the prime suspect.\nIn the fallout from and the aftermath of Shakur's death, both Dr. Dre and Snoop Dogg left Deathrow Records. Rapidly, the label declined, and it was soon eclipsed. Meanwhile, allegations mounted that Knight, beyond employing gang members, had often plied intimidation and violence in his business dealings. From the late 1990s into the early 2000s, Knight spent a few years incarcerated for assault convictions and associated violations of probation and parole. In September 2018, upon pleading no contest to voluntary manslaughter in a fatal 2015 hit-and-run, Knight was sentenced to 28 years in prison. He is scheduled to become eligible for parole in October 2037."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "苏格·奈特", "details": ""}]}