{"id": "sweet sweetback's baadasssss song", "name": "Sweet Sweetback's Baadasssss Song", "consensus_translation": "甜蜜的斯维特拜克炫酷之歌", "category": "影视剧", "alias": "", "group": "", "author": "Melvin Van Peebles", "album": "", "date": "1971", "language": "en", "wikipedia": {"pageid": 1237909, "ns": 0, "title": "Sweet Sweetback's Baadasssss Song", "extract": "Sweet Sweetback's Baadasssss Song is a 1971 American blaxploitation action thriller film written, co-produced, scored, edited, directed by and starring Melvin Van Peebles. His son Mario Van Peebles also appears in a small role, playing the title character as a young boy. It tells the picaresque story of the flight of a poor black man from the white police authorities.\nVan Peebles began to develop the film after being offered a three-picture contract for Columbia Pictures. No studio would finance the film, so Van Peebles funded it himself, shooting it independently over 19 days, performing all of his own stunts and appearing in several sex scenes, some reportedly unsimulated. He received a $50,000 loan from Bill Cosby to complete the project. The film's fast-paced montages and jump-cuts were unique features in American cinema at the time. The picture was censored in some markets, and received mixed reviews. However, it has left a lasting impression on American cinema.\nThe musical score of Sweet Sweetback's Baadasssss Song was performed by Earth, Wind & Fire. Van Peebles did not have money for traditional advertising methods, so released the soundtrack album prior to the film's release in order to generate publicity. Initially, the film was screened in only two theaters in the United States. It went on to gross $15.2 million at the box office. Huey P. Newton celebrated and welcomed the film's revolutionary implications, and Sweetback became required viewing for members of the Black Panther Party. According to Variety, it demonstrated to Hollywood that films which portrayed \"militant\" blacks could be highly profitable, leading to the creation of the blaxploitation genre, although critic Roger Ebert, commenting on a review of the 2004 film about the making of this movie, did not consider this example of Van Peebles' work to be an exploitation film.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "甜蜜的斯维特拜克炫酷之歌", "details": "Sweetback是否有必要意译？Bassdasssss暂时译成了“炫酷”，有没有其他比较好的建议？"}, {"user_name": "Tian Tang", "github_handle": "Tian-Tang", "translation": "baddass 可以翻译成 帅痞", "details": ""}]}