{"id": "tego calderón", "name": "Tego Calderón", "consensus_translation": "泰戈·卡尔德隆", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 480420, "ns": 0, "title": "Tego Calderón", "extract": "Tegui Calderón Rosario (born February 1, 1972) is a Puerto Rican hip hop recording artist and actor. He began his musical career in 1996 (as Tego Tec) and was supported by the famous Puerto Rican rapper Eddie Dee, who invited him on his second studio album, El Terrorista De La Lírica, released in 2000. Calderón reached international success in 2003 with his first album, El Abayarde, which sold 300.000 copies worldwide and was nominated for a Latin Grammy Award. His importance in reggaeton music led him to participate in Eddie Dee's 12 Discípulos album in 2004. He released three more studio albums between 2006 and 2015, varying in styles, focusing more in hip hop and African music rather than reggaeton in The Underdog (2006) and El Abayarde Contraataca (2007). His fourth studio album, El Que Sabe, Sabe, released in 2015, won a Latin Grammy Award for Best Urban Music Album. In the same year, he announced that he is planning a studio album alongside the Puerto Rican reggaeton and pop singer Yandel titled El Blanco Y El Negro.\nTego is characterized by his social and political themes, with lyrics against Puerto Rican government, denouncing any corruption case. His themes also include dance, love, human-self reflection and personal experiences.\nHis film career started in 2007 with his supporting role in Illegal Tender. In 2009 he had a lead role in a short film called Los Bandoleros, which is part of The Fast and the Furious franchise, and in the same year he had a cameo appearance in the fourth installment of that franchise, Fast & Furious. In 2011 he had a supporting role in Fast Five alongside his colleague and friend Don Omar.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "泰戈·卡尔德隆", "details": ""}]}