{"id": "thank me later", "name": "Thank Me Later", "consensus_translation": "先别谢我", "category": "专辑", "alias": "", "group": "", "author": "Drake", "album": "", "date": "2010", "language": "en", "wikipedia": {"pageid": 23031540, "ns": 0, "title": "Thank Me Later", "extract": "Thank Me Later is the debut studio album by Canadian rapper and singer Drake. It was released on June 15, 2010, by Young Money Entertainment, Cash Money Records, and Universal Motown Records. Production for the album took place at various recording studios during 2009 to 2010 and was mostly produced by longtime collaborators 40 and Boi-1da. It also featured contributions from Timbaland, Swizz Beatz, Nicki Minaj, Lil Wayne, The-Dream, and Kanye West, among others.\nThank Me Later has a languorous, ambient production that incorporates moody synthesizers, sparse beats, obscured keyboards, minor keys, and subtle arrangements. Thematically, the album focuses on Drake's introduction to fame and his romances over the course of confessional, club-oriented, and sexual songs. Drake's emotionally transparent, self-deprecating lyrics are delivered in both rapped and subtly sung verses, and explore feelings of doubt, insecurity, and heartbreak.\nFollowing an anticipated release, Thank Me Later debuted at number one on the Billboard 200 with first week sales of 447,000 copies in the US, eventually selling 1.8 million copies there by August 2015. It also topped the Canadian Albums Chart and attained a platinum certification in Canada in its debut week. All four of the album's singles became top 40 hits on the Billboard Hot 100, with \"Find Your Love\" reaching number five. Reviews of Thank Me Later were generally positive, with critics applauding Drake's personal themes and drawing musical comparisons to the works of Kid Cudi and West, particularly his 2008 album 808s & Heartbreak. It later ranked as one of 2010's best albums."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "先别谢我", "details": ""}]}