{"id": "the honeydrippers", "name": "The Honeydrippers", "consensus_translation": "甜如蜜合唱团", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 2887385, "ns": 0, "title": "The Honeydrippers", "extract": "The Honeydrippers were a rock and roll band of the 1980s, deriving their name from Roosevelt Sykes, an American blues singer also known as \"Honeydripper\". Former Led Zeppelin lead singer Robert Plant formed the group in 1981 to satisfy his long-time goal in having a rock band with a heavy rhythm and blues basis. Formed originally in Worcestershire, the band was also composed of fellow former Led Zeppelin member Jimmy Page; Jeff Beck (a former Yardbirds member like Page); and other friends and well-known studio musicians including original Judas Priest guitarist Ernest Chataway. The band released only one recording, an EP titled The Honeydrippers: Volume One, on 12 November 1984.They performed in a concert at Keele University in 1981. The Honeydrippers peaked at number 3 in early 1985 on the Billboard Hot 100 with a remake of the Phil Phillips' tune \"Sea of Love\", and hit number 25 with \"Rockin' at Midnight\", originally a Roy Brown recording and a rewrite of \"Good Rockin' Tonight.\"  With the EP's success, Plant stated that a full album would be recorded, but it never was. The band appeared on Saturday Night Live on 15 December 1984, performing \"Rockin' at Midnight\" and \"Santa Claus Is Back in Town.\"  The band featured Brian Setzer and Georg Wadenius on guitar, Tom Barney on bass, Paul Shaffer on piano, Buddy Williams on drums, Michael Brecker, Lou Marini, and Ronnie Cuber on saxophones, Jon Faddis on trumpet and Tom Malone on trombone.\nOn 23 December 2006, Plant performed a charity show at Kidderminster Town Hall under the title 'The Return of the Honeydrippers' to raise money for his neighbour Jackie Jennings, who was undergoing treatment for a brain tumor."}, "opinions": [{"user_name": "mimida", "github_handler": "idmimida", "translation": "甜如蜜合唱团", "details": ""}, {"user_name": "Tian Tang", "github_handler": "Tian-Tang", "translation": "甜如蜜合唱团", "details": "甜如蜜更贴切。或者甜蜜小子。The term \"honeydripper\" was black slang for a \"sweet\" guy, and had already been adopted as a nickname by blues pianist Roosevelt Sykes."}]}