{"id": "the chronic", "name": "The Chronic", "consensus_translation": "慢性", "category": "专辑", "alias": "", "group": "", "author": "Dr. Dre", "album": "-", "date": "1993", "language": "en", "wikipedia": {"pageid": 194546, "ns": 0, "title": "The Chronic", "extract": "The Chronic is the debut studio album by American hip hop producer and rapper Dr. Dre. It was released on December 15, 1992, by his own record label Death Row Records and distributed by Interscope Records. Recording sessions for the album took place in June 1992 at Death Row Studios in Los Angeles and at Bernie Grundman Mastering in Hollywood. The album is named after a slang term for high-grade cannabis, and its cover is an homage to Zig-Zag rolling papers. It was Dr. Dre's first solo album after he had departed from hip hop group N.W.A and its label Ruthless Records over a financial dispute. \nOn The Chronic, he included both subtle and direct insults at Ruthless and its owner, former N.W.A member Eazy-E. Although a solo album, it features many appearances by then-emerging American rapper Snoop Doggy Dogg, who used the album as a launch pad for his own solo career. \nThe Chronic peaked at number three on the Billboard 200 and has been certified triple platinum by the Recording Industry Association of America with sales of 3 million copies in the United States, which led to Dr. Dre becoming one of the top ten best-selling American performing artists of 1993. The Chronic spent eight months in the Billboard Top 10. The album's three singles became top ten Billboard singles. \"Nuthin' but a \"G\" Thang\" peaked at number two on the Billboard Hot 100 and at number one on both the Hot Rap Singles and Hot R&B Singles charts.Dr. Dre's production has been noted for popularizing the G-funk subgenre within gangsta rap. The Chronic has been widely regarded as one of the most important and influential albums of the 1990s and regarded by many fans and peers to be one of the most well-produced hip hop albums of all time. The Chronic was ranked at 138 on Rolling Stone's 500 Greatest Albums of All Time. In 2020, the album was selected by the Library of Congress for preservation in the National Recording Registry for being \"culturally, historically, or aesthetically significant\".\n\n"}, "opinions": [{"user_name": "mimida", "github_handler": "idmimida", "translation": "好货色", "details": "Netflix翻译"}, {"user_name": "Lil Bag", "github_handler": "Lil-Bag", "translation": "慢性", "details": "多年以来的固定翻译，不用管准不准"}]}