{"id": "the slim shady lp", "name": "The Slim Shady LP", "consensus_translation": "瘦痞子LP", "category": "专辑", "alias": "", "group": "", "author": "Eminem", "album": "", "date": "1999", "language": "en", "wikipedia": {"pageid": 182021, "ns": 0, "title": "The Slim Shady LP", "extract": "The Slim Shady LP is the second studio album and the major-label debut by American rapper Eminem, released on February 23, 1999 by Aftermath Entertainment and Interscope Records. Recorded in Ferndale, Michigan, following Eminem's recruitment by Dr. Dre and Jimmy Iovine, the album features production from Dr. Dre, the Bass Brothers, and Eminem himself. The Slim Shady LP is his first album with a major label after his first album Infinite was released on an independent label in 1996.Featuring West Coast hip hop, G-funk and horrorcore musical styles, the majority of The Slim Shady LP's lyrical content is written from the perspective of Eminem's alter ego Slim Shady, whom he created on the Slim Shady EP (1997). The Slim Shady LP contains cartoonish depictions of violence and heavy use of profanity, which Eminem referred to as \"made-up tales of trailer-park stuff,\" describing it as horror film-esque, in that it is solely for entertainment value. Although many of the lyrics on the album are considered be satirical, Eminem also depicts his frustrations of living in poverty.\nThe Slim Shady LP debuted at number two on the Billboard 200 and number one on the Top R&B/Hip-Hop Albums chart. It received commercial and critical success, with critics praising Eminem for his unique lyrical style, dark humor lyrics, and eccentric personality. The first single, \"My Name Is\", became Eminem's first entry on the Billboard Hot 100. The album won Best Rap Album at 2000 Grammy Awards, while \"My Name Is\" won Best Rap Solo Performance. In 2000, The Slim Shady LP was certified quadruple platinum by the Recording Industry Association of America (RIAA).\nWhile The Slim Shady LP's success turned Eminem from an underground rapper into a high-profile celebrity, he became a highly controversial figure due to his lyrical content, which some perceived to be misogynistic and a negative influence on American youth. Despite this, the album's success was vital in breaking the stereotype that \"white people cannot rap\", and has since been included in several publications' lists of the greatest albums of all time."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "阴暗的瘦子LP", "details": ""}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "瘦痞子LP", "details": ""}, {"user_name": "Lil Bag", "github_handle": "Lil-Bag", "translation": "微晕（台译）", "details": ""}]}