{"id": "the white album", "name": "The White Album", "consensus_translation": "白色专辑", "category": "专辑", "alias": "", "group": "", "author": "The Beatles", "album": "", "date": 1968.0, "language": "en", "wikipedia": {"pageid": 75350, "ns": 0, "title": "The Beatles (album)", "extract": "The Beatles, also known as the White Album, is the ninth studio album and only double album by the English rock band the Beatles, released on 22 November 1968. Its plain white sleeve has no graphics or text other than the band's name embossed, which was intended as a direct contrast to the vivid cover artwork of the band's previous LP Sgt. Pepper's Lonely Hearts Club Band. The Beatles is recognised for its fragmentary style and diverse range of genres, including folk, British blues, ska, music hall and the avant-garde. It has since been viewed by some critics as a postmodern work, as well as among the greatest albums of all time.\nMost of the songs on the album were written during March and April 1968 at a Transcendental Meditation course in Rishikesh, India. There, the only western instrument available to the band was the acoustic guitar; some of these songs remained acoustic on The Beatles and were recorded solo, or only by part of the group. The production aesthetic ensured that the album's sound was scaled-down and less reliant on studio innovation than all their releases since 1966's Revolver. The Beatles also broke with the band's recent tradition of incorporating several musical styles in one song by keeping each piece of music consistently faithful to a select genre.\nAt the end of May 1968, the Beatles returned to EMI Studios in London to commence recording sessions that lasted until mid-October. During these sessions, arguments broke out among the foursome over creative differences and John Lennon's new partner, Yoko Ono, whose constant presence subverted the Beatles' policy regarding wives and girlfriends in the studio. After a series of problems, including producer George Martin taking a sudden leave of absence and engineer Geoff Emerick suddenly quitting, Ringo Starr left the band briefly in August. The same tensions continued throughout the following year and led to the band's break-up.\nThe Beatles received favourable reviews from the majority of music critics; detractors found its satirical songs unimportant and apolitical amid the turbulent political and social climate of 1968. Nonetheless, The Beatles topped record charts in Britain and the United States. Although no singles were issued in either territory, the songs \"Hey Jude\" and \"Revolution\" originated from the same recording sessions and were issued on a single in August 1968. The album has been certified 24× platinum by the RIAA."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "白色专辑", "details": ""}]}