{"id": "the fat boys", "name": "The Fat Boys", "consensus_translation": "肥仔团", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 1835337, "ns": 0, "title": "The Fat Boys", "extract": "The Fat Boys are an American hip hop trio from Brooklyn, New York City, that emerged in the early 1980s. The group was briefly known originally as the Disco 3, originally composed of Mark \"Prince Markie Dee\" Morales, Damon \"Kool Rock-Ski\" Wimbley and Darren \"Buff Love\" Robinson, who died of a heart attack during a bout with respiratory flu in 1995.\nThe trio is widely known for using beatbox in their songs. The group opened doors for beatboxers like Biz Markie and Doug E. Fresh. The Fat Boys was one of the first rap groups to release full-length rap albums, along with Run-D.M.C., Whodini and Kurtis Blow. Beloved for their comedic, self-deprecating rhymes, the group released 7 studio albums, 4 of which went Gold by RIAA.\nThe first two albums of the group were produced by the legendary Kurtis Blow, and they were successful due to the singles \"Jail House Rap\", \"Can You Feel It?\", \"Fat Boys\", \"Stick 'Em\", \"Don't You Dog Me\", \"All You Can Eat\", \"The Fat Boys Are Back\", \"Pump It Up\", and videos to them.\nThe album Crushin' received a Platinum status due to their loud single \"Wipeout\", which was recorded together with the American rock group The Beach Boys. The next album, Coming Back Hard Again, repeated the formula of the previous one and received a Gold status due to the successful single \"The Twist (Yo, Twist)\", recorded together with American rock 'n roll singer Chubby Checker. The album also included the theme song for the movie A Nightmare on Elm Street 4: The Dream Master, which featured Robert Englund performing as Freddy Krueger.\nThe group also starred in three feature films in the 1980s, thereby strengthening the popularity of hip-hop in America: Krush Groove, Knights of the City and Disorderlies.\n\n"}, "opinions": [{"mimida": {"user_name": "mimida", "github_handler": "mimida", "translation": "肥仔团", "details": ""}}]}