{"id": "the infamous", "name": "The Infamous", "consensus_translation": "恶名昭著", "category": "专辑", "alias": "", "group": "", "author": "Mobb Deep", "album": "", "date": "1995", "language": "en", "wikipedia": {"pageid": 3023143, "ns": 0, "title": "The Infamous", "extract": "The Infamous (stylized as The Infamous...) is the second studio album by the American hip hop duo Mobb Deep. It was released on April 25, 1995, by Loud Records. The album features guest appearances by Nas, Raekwon, Ghostface Killah, and Q-Tip, who also contributed to its production and mixing. Most of the leftover songs from the album became bonus tracks for Mobb Deep's The Infamous Mobb Deep album (2014).\nUpon its release, The Infamous achieved notable commercial success, debuting at number 15 on the US Billboard 200 and number 3 on the Top R&B/Hip Hop Albums charts. On June 26, 1995, the album was certified gold by the Recording Industry Association of America (RIAA). The album produced four singles; \"Shook Ones (Part II)\", \"Survival of the Fittest\", \"Temperature's Rising\", \"Give Up the Goods (Just Step)\"; the first three singles achieved varying degrees of chart success, with \"Shook Ones (Part II)\" being the most successful.\nThe album's dark, haunting style, defined by its evocative melodies, rugged beats, and lyrics dealing with crime in inner city neighborhoods, reflected the destitute side of New York's urban landscape in a manner that received special recognition and critical praise. Along with albums such as Enter the Wu-Tang (36 Chambers), Illmatic and Ready to Die, The Infamous is widely credited as a major contributor to the East Coast Renaissance. Furthermore, the album is credited with helping to redefine the sound of hardcore hip hop, using its production style, which incorporated eerie piano loops, distorted synthesizers, eighth-note hi-hats, and sparse filtered basslines."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "恶名昭著", "details": ""}]}