{"id": "the way i are", "name": "The Way I Are", "consensus_translation": "本色", "category": "歌", "alias": "", "group": "", "author": "Timbaland", "album": "《Timbaland presents Shock Value》", "date": "2007", "language": "en", "wikipedia": {"pageid": 10929149, "ns": 0, "title": "The Way I Are", "extract": "\"The Way I Are\" is a song by American rapper Timbaland, released as the second single from his second studio album Shock Value (2007). The song features vocals by singer Keri Hilson. The two artists co-wrote the song together with Danja, The Clutch, and Candice Nelson. Timbaland and Danja also produced the song together. Mosley Music Group, in association with Blackground Records and Interscope Records, serviced the song to contemporary hit and rhythmic radios in the United States on June 15, 2007. \"The Way I Are\" is a hip hop and electro song with influences of R&B and dance music that help create its futuristic sound. Its lyrics are based on the theme of role reversal and sensuous desires.\nThe song peaked at number three on the Billboard Hot 100 and sold over 3 million units in the United States. It became Timbaland's second solo single to reach the top five in the country as well as his second longest-running single there, behind \"Apologize\". Internationally, \"The Way I Are\" reached number one in several countries including Australia, Canada, Denmark, Ireland and the United Kingdom. Elsewhere, the song reached the top five region in all other countries including Austria, France, Germany, New Zealand and Russia.\nThe accompanying music video was directed by Shane Drake and takes place in a dark alley-like area in Salford, England. The video also features Timbaland's brother Sebastian, who contributes an extra verse after the bridge. The director noted that the influence of making the video came from the sound of the song and used the rhythm and beats to add effects to make the video have an edgy appeal. \"The Way I Are\" received a nomination for Monster Single of the Year at the MTV Video Music Awards, as well as a nomination under the Producer of the Year (Non-Classical), listed with other songs produced by Timbaland and released during 2007, at the 2008 Grammys. The song is featured in NBA Live 08."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "本色", "details": ""}, {"user_name": "Tian Tang", "github_handle": "Tian-Tang", "translation": "这就是我", "details": ""}, {"user_name": "redhousepainter", "github_handle": "redhousepainter", "translation": "这就是我", "details": "这估计是timbaland瞎用语法，the way I am"}]}