{"id": "the drifters", "name": "The Drifters", "consensus_translation": "漂流者合唱团", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 164417, "ns": 0, "title": "The Drifters", "extract": "The Drifters are an American doo-wop and R&B/soul vocal group. They were originally formed as a backing group for Clyde McPhatter, formerly the lead tenor of Billy Ward and his Dominoes in 1953.\nAccording to Rolling Stone magazine, the Drifters were the least stable of the great vocal groups, as they were low-paid musicians hired by George Treadwell, who owned the Drifters' name from 1955, after McPhatter left. There have been 60 vocalists in the history of the Treadwell Drifters line, including several splinter groups by former Drifters members (not under Treadwell's management). These groups are usually identified with a possessive credit such as \"Bill Pinkney's Original Drifters\", \"Charlie Thomas' Drifters\".\nThere were three golden eras of the Drifters; the early 1950s, the 1960s, and the early 1970s (post-Atlantic period). From these, the first Drifters, formed by Clyde McPhatter, was inducted into the Vocal Group Hall of Fame as \"The Drifters\". The second Drifters, featuring Ben E. King, was separately inducted into the Vocal Group Hall of Fame as \"Ben E. King and the Drifters\". In their induction, the Rock and Roll Hall of Fame selected four members from the first Drifters, two from the second Drifters, and one from the post-Atlantic Drifters.According to the Vocal Group Hall of Fame: \"Through turmoil and changes, the (original) Drifters managed to set musical trends and give the public 13 chart hits, most of which are legendary recordings today.\" Matching that feat, subsequent formations of the Drifters recorded 13 Billboard Hot 100 top 30 chart hits.  The 1950s and 60s incarnations of the group were also a force on the US R&B charts, notching six number one R&B hits:  \"Money Honey\" (1953), \"Honey Love\" (1954), \"Adorable\" (1955), \"There Goes My Baby\" (1959), \"Save The Last Dance For Me\" (1960) and \"Under The Boardwalk\" (1964).  A 1970s revival in Britain, with both old and new material, was not matched in the United States, although it saw their biggest successes on the UK pop charts, peaking with the number 2 hit \"Kissin' in the Back Row of the Movies\".\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "漂流者合唱团", "details": ""}]}