{"id": "the chipmunks", "name": "The Chipmunks", "consensus_translation": "花栗鼠三重唱", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 355901, "ns": 0, "title": "Alvin and the Chipmunks", "extract": "Alvin and the Chipmunks, originally David Seville and the Chipmunks or simply the Chipmunks, are an American animated virtual band created by Ross Bagdasarian Sr. for a novelty record in 1958. The group consists of three singing animated anthropomorphic chipmunks: Alvin, the mischievous troublemaker; Simon, the tall, bespectacled intellectual; and Theodore, the chubby, shy one. The trio is managed by their human adoptive father, David (Dave) Seville. In reality, \"David Seville\" was Bagdasarian's stage name, and the Chipmunks themselves are named after the executives of their original record label. The characters became a success, and the singing Chipmunks and their manager were given life in several animated cartoon productions, using redrawn, anthropomorphic chipmunks, and eventually films.\nThe voices of the group were all performed by Bagdasarian, who sped up the playback to create high-pitched squeaky voices. This oft-used process was not entirely new to Bagdasarian, who had also used it for two previous novelty songs, including \"Witch Doctor\", but it was so unusual and well-executed it earned the record two Grammy Awards for engineering. Bagdasarian, performing as the Chipmunks, released a long line of albums and singles, with \"The Chipmunk Song\" becoming a number-one single in the United States. After Bagdasarian's death in 1972, the characters' voices were performed by his son Ross Bagdasarian Jr. and the latter's wife Janice Karman in the subsequent incarnations of the 1980s and 1990s.\nIn the 2007 CGI/live-action film adaptation and its 2009 sequel, they were voiced in dialogue by Justin Long, Matthew Gray Gubler and Jesse McCartney. Bagdasarian Jr. and Karman continue to perform the singing voices for Alvin, Theodore and the Chipettes, but Steve Vining does Simon's singing voice. The project has earned five Grammy awards, an American Music Award, a Golden Reel Award, and three Kids' Choice Awards, and has been nominated for three Emmy awards.\nA third film installment, Alvin and the Chipmunks: Chipwrecked, was released in theaters on December 16, 2011. Fox 2000 Pictures and Regency Enterprises announced a fourth installment, titled Alvin and the Chipmunks: The Road Chip, released on December 18, 2015.\nA CGI-animated TV series reboot, titled ALVINNN!!! and the Chipmunks, premiered on Nickelodeon on August 3, 2015.\nThrough the continued success of the franchise, the Chipmunks have become the most successful children's artists of all time while garnering two number-one singles on the Billboard Hot 100, winning five Grammy Awards, having four Top 10 albums on the Billboard 200, three certified platinum albums and the song \"The Chipmunk Song\" became one of the best-selling singles of all time with 5 million physical copies sold."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "花栗鼠三重唱", "details": ""}]}