{"album":"","alias":"","author":"David Simon","category":"剧集","consensus_translation":"","date":"2002-2008","group":"","id":"the wire","name":"The Wire","language":"en","romanization":"","wikipedia":{"pageid":1102458,"ns":0,"title":"The Wire","extract":"The Wire is an American crime drama television series created and primarily written by author and former police reporter David Simon. The series was broadcast by the cable network HBO in the United States. The Wire premiered on June 2, 2002 and ended on March 9, 2008, comprising 60 episodes over five seasons. The idea for the show started out as a police drama loosely based on the experiences of his writing partner Ed Burns, a former homicide detective and public school teacher.Set and produced in Baltimore, Maryland, The Wire introduces a different institution of the city and its relationship to law enforcement in each season, while retaining characters and advancing storylines from previous seasons. The five subjects are, in chronological order: the illegal drug trade, the seaport system, the city government and bureaucracy, education and schools, and the print news medium. Simon chose to set the show in Baltimore because of his familiarity with the city. The large cast consists mainly of actors who are little known for their other roles, as well as numerous real-life Baltimore and Maryland figures in guest and recurring roles. Simon has said that despite its framing as a crime drama, the show is \"really about the American city, and about how we live together. It's about how institutions have an effect on individuals. Whether one is a cop, a longshoreman, a drug dealer, a politician, a judge or a lawyer, all are ultimately compromised and must contend with whatever institution to which they are committed.\"The Wire is lauded for its literary themes, its uncommonly accurate exploration of society and politics, and its realistic portrayal of urban life. Although during its original run the series received only average ratings and never won any major television awards, it is now widely regarded as one of the greatest television shows of all time."},"opinions":[]}