{"id": "the blueprint", "name": "The Blueprint", "consensus_translation": "蓝图", "category": "专辑", "alias": "", "group": "", "author": "Jay-Z", "album": "", "date": "2000", "language": "en", "wikipedia": {"pageid": 518542, "ns": 0, "title": "The Blueprint", "extract": "The Blueprint is the sixth studio album by American rapper Jay-Z. It was released on September 11, 2001, by Roc-A-Fella Records and Def Jam Recordings. Its release was set a week earlier than initially planned in order to combat bootlegging. Recording sessions for the album took place during 2001 at Manhattan Center Studios and Baseline Studios in New York City. Contrasting the radio-friendly sound of Jay-Z's previous work, The Blueprint features soul-based sampling and production handled primarily by Kanye West, Just Blaze, and Bink, as well as Timbaland, Trackmasters, and Eminem, who also contributes the album's sole guest feature.\nAt the time of the album's recording, Jay-Z was awaiting two criminal trials, one for gun possession and another for assault, and had become one of hip hop's most dissed artists, receiving insults from rappers such as Nas, Prodigy, and Jadakiss. The album is also famous for both its producers Kanye West and Just Blaze's breakouts as major producers. Kanye West produced four of the thirteen tracks on the album, including the songs \"Izzo (H.O.V.A.)\" and the controversial \"Takeover,\" which included diss lyrics aimed at rappers Nas and Prodigy, while Just Blaze produced three tracks, \"Girls, Girls, Girls\", \"Song Cry\", and \"U Don't Know\", also including the hidden bonus track \"Breathe Easy (Lyrical Exercise)\".\nThe Blueprint received universal acclaim from music critics, with praise being directed at Jay-Z's lyricism and the production. It is considered one of his best albums and has also been labeled as one of the greatest hip-hop albums of all time. Despite its release coinciding with the September 11 attacks, it sold over 427,000 copies in its opening week and debuted at number one in the US, holding the spot for three weeks. It was later certified 2x Multi-Platinum by the RIAA.\nIn 2019, the album was selected by the Library of Congress for preservation in the National Recording Registry for being \"culturally, historically, or aesthetically significant\"."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "蓝图", "details": ""}]}