{"album":"","alias":"","author":"Kendrick Lamar","category":"专辑","consensus_translation":"","date":"2015","group":"","id":"to pimp a butterfly","name":"To Pimp A Butterfly","language":"en","romanization":"","wikipedia":{"pageid":45600219,"ns":0,"title":"To Pimp a Butterfly","extract":"To Pimp a Butterfly is the third studio album by American rapper Kendrick Lamar. It was released on March 15, 2015, by Top Dawg Entertainment, distributed by Aftermath Entertainment and Interscope Records. The album was recorded in studios throughout the United States, with production from Sounwave, Terrace Martin, Taz \"Tisa\" Arnold, Thundercat, Rahki, LoveDragon, Flying Lotus, Pharrell Williams, Boi-1da, Knxwledge, and several other high-profile hip hop producers, as well as executive production from Dr. Dre and Anthony \"Top Dawg\" Tiffith. Guest appearances include Thundercat, George Clinton, Bilal, Anna Wise, Snoop Dogg, James Fauntleroy, Ronald Isley, and Rapsody.\nThe music of To Pimp a Butterfly incorporates a variety of styles from traditional African-American music, including jazz, funk, soul, spoken word, and avant-garde. Lyrically, it features political commentary and personal themes concerning African-American culture, racial inequality, depression, and institutional discrimination. This thematic direction was inspired by Lamar's tour of historic sites during his visit to South Africa, such as Nelson Mandela's jail cell on Robben Island.\nTo Pimp a Butterfly sold 324,000 copies in the US in its first week of release, earning a chart debut at number one on the US Billboard 200, while also becoming Lamar's first number-one album in the UK. It was eventually certified platinum by the Recording Industry Association of America (RIAA) and sold one million copies in the US by 2017. Five singles were released in promotion of the album, including the top 40 hit \"I\". Lamar also supported the album with the Kunta's Groove Sessions Tour from late 2015 to early 2016.\nTo Pimp a Butterfly received widespread acclaim from critics, who praised its musical scope and the social relevance of Lamar's lyrics. It earned Lamar 11 nominations at the 2016 Grammy Awards, which was the most nominations for any rapper in a single night, including wins for Best Rap Album and an Album of the Year nomination. The most acclaimed album of 2015, it topped the The Village Voice's annual Pazz \u0026 Jop poll of American critics nationwide, and was also ranked as the best album of 2015 by many other publications. In the years following its release, several publications have named it one of the best albums of the 2010s decade."},"opinions":[{"details":"\"In an interview with MTV, Kendrick explains the original title of the album was Tu Pimp a Caterpillar, the initials of which spell out Tupac, who, of course, made an appearance on the album's final track 'Mortal Man'. Before Kendrick confirmed the pre-Butterfly title, he was impressed to see that a group of journalists, on DeadEndHipHop, had already suggested the idea that the title must be some sort of Tupac acronym. Kendrick said he changed Caterpillar to Butterfly to show 'the brightness of life’. And the word 'pimp' has so much aggression. Kendrick also says the title signifies 'using my celebrity for good' and 'not being pimped by the industry through my celebrity'. There are details, however, that will likely never be unearthed, as Kendrick says, 'It gets even deeper than that for me. I could be talking all day about it.'\"\n\nhttps://www.hotnewhiphop.com/kendrick-lamar-reveals-meaning-behind-to-pimp-a-butterfly-album-title-news.14641.html\n\n常见译法”破茧成蝶“可能还不是太贴切，但暂时想不出更合适的了。","github_handle":"idmimida","translation":"破茧成蝶","user_name":"mimida","user_bio":"","user_avatar_url":"https://avatars0.githubusercontent.com/u/39655292?v=4"}]}