{"id": "tour de france", "name": "Tour de France", "consensus_translation": "环法自行车赛", "category": "歌", "alias": "", "group": "", "author": "Kraftwerk", "album": "", "date": "1983", "language": "en", "wikipedia": {"pageid": 30498, "ns": 0, "title": "Tour de France", "extract": "The Tour de France (French pronunciation: ​[tuʁ də fʁɑ̃s]) is an annual men's multiple stage bicycle race primarily held in France, while also occasionally passing through nearby countries. Like the other Grand Tours (the Giro d'Italia and the Vuelta a España), it consists of 21 day-long stages over the course of 23 days. It has been described as \"the world’s most prestigious and most difficult bicycle race\".The race was first organized in 1903 to increase sales for the newspaper L'Auto and is currently run by the Amaury Sport Organisation. The race has been held annually since its first edition in 1903 except when it was stopped for the two World Wars. As the Tour gained prominence and popularity, the race was lengthened and its reach began to extend around the globe. Participation expanded from a primarily French field, as riders from all over the world began to participate in the race each year. The Tour is a UCI World Tour event, which means that the teams that compete in the race are mostly UCI WorldTeams, with the exception of the teams that the organizers invite. It has become \"the world's biggest annual sporting event.\" A women's Tour de France was held under different names between 1984 and 2009. Since 2014, the La Course by Le Tour de France is held for women in a one- or two-day format during the men's race.\nTraditionally, the race is held primarily in the month of July. While the route changes each year, the format of the race stays the same with the appearance of time trials, the passage through the mountain chains of the Pyrenees and the Alps, and the finish on the Champs-Élysées in Paris. The modern editions of the Tour de France consist of 21 day-long segments (stages) over a 23-day period and cover around 3,500 kilometres (2,200 mi). The race alternates between clockwise and counterclockwise circuits of France.There are usually between 20 and 22 teams, with eight riders in each. All of the stages are timed to the finish; the riders' times are compounded with their previous stage times. The rider with the lowest cumulative finishing times is the leader of the race and wears the yellow jersey. While the general classification garners the most attention, there are other contests held within the Tour: the points classification for the sprinters, the mountains classification for the climbers, young rider classification for riders under the age of 26, and the team classification, based on the first three finishers from each team on each stage. Achieving a stage win also provides prestige, often accomplished by a team's sprint specialist or a rider taking part in a breakaway.\n\n"}, "opinions": [{"user_name": "mimida", "github_handler": "mimida", "translation": "环法自行车赛", "details": ""}]}