{"id": "trevor horn", "name": "Trevor Horn", "consensus_translation": "特雷弗·霍恩", "category": "乐人", "alias": "", "group": "The Buggles", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 176078, "ns": 0, "title": "Trevor Horn", "extract": "Trevor Charles Horn  (born 15 July 1949) is an English bassist, singer, songwriter, music producer, and recording studio and label owner. He is best known for his production work since the 1980s and, before that, being one half of the new wave band the Buggles (with Geoff Downes). Horn took up the bass guitar at an early age and taught himself the instrument and to sight-read music. In the 1970s, he worked as a session musician, built his own studio, and wrote and produced singles for various artists.\nHorn and Downes gained international fame in 1979 with the Buggles' hit single \"Video Killed the Radio Star\". This was followed by their one-year tenure with the progressive rock band Yes, with Horn becoming their lead singer. In 1981, Horn became a full-time producer, working on commercially successful songs and albums for numerous artists, among them Dollar, ABC, Malcolm McLaren, Yes, and Frankie Goes to Hollywood. He ventured into business with his wife Jill Sinclair, purchasing SARM West Studios and establishing the publishers Perfect Songs and their own label, ZTT Records. In the following year, Horn co-formed the electronic group Art of Noise. In the 1990s, Horn's success continued with his association with Seal. He has been a member of the supergroup Producers, later known as the Trevor Horn Band, since 2006.\nHorn has won numerous awards, including three Brit Awards for Best British Producer in 1983, 1985, and 1992. He won a Grammy Award for producing Seal's 1994 hit \"Kiss from a Rose\". In 2010, Horn received an Ivor Novello Award for Outstanding Contribution to British Music. His influence on pop and electronic music in the 1980s was such that he has been called \"The Man Who Invented the Eighties\"."}, "opinions": [{"user_name": "mimida", "github_handler": "mimida", "translation": "特雷弗·霍恩", "details": ""}]}