{"id": "underground kingz", "name": "Underground Kingz", "consensus_translation": "地下之王", "category": "专辑", "alias": "", "group": "", "author": "UGK", "album": "", "date": 2007.0, "language": "en", "wikipedia": {"pageid": 6584970, "ns": 0, "title": "Underground Kingz", "extract": "Underground Kingz is the fifth studio album by American hip hop duo UGK. The album was released on August 7, 2007, by Jive Records. The album includes collaborations with Z-RO, T.I., Talib Kweli, Rick Ross, Jazze Pha, Kool G Rap, Big Daddy Kane, Slim Thug, Dizzee Rascal, Too Short, Charlie Wilson, Middle Fingaz, OutKast, Three 6 Mafia, and many more. Production mainly came from Pimp C, N.O. Joe, Lil Jon, Jazze Pha, Swizz Beatz, DJ Paul & Juicy J, Scarface and Marley Marl.\nThe first single was believed to be \"Stop-N-Go\", but it was confirmed that the first single was \"The Game Belongs To Me\", produced by N.O. Joe.\nThe second single was \"Int'l Players Anthem (I Choose You)\" featuring OutKast, and the video was released on 106 and Park, June 16, 2007. The track is a remix of \"Players Anthem\" featuring Three 6 Mafia (both versions were produced by DJ Paul and Juicy J). The video was awarded Video of the Year at the 2008 annual BET Hip-Hop awards. The song was nominated for the Grammy Award for Best Rap Performance by a Duo or Group. This song was number 10 on Rolling Stone's list of the 100 Best Songs of 2007, and reached number 70 on the Billboard Hot 100, making it their only song to chart there.\nPitchfork Media's \"Top 500 songs of the 2000s\" listed the song at number 43. The album debuted number 1 on the Billboard 200 with 160,000 copies sold in its first week. It was their first album since Pimp C had finished serving a lengthy prison term. The album was also Pimp C's final performance before his death on December 4, 2007, in Los Angeles, California, four months after the album's release. As of 2011, it has sold 500,000 copies."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "地下之王", "details": ""}]}