{"id": "video killed the radio star", "name": "Video Killed the Radio Star", "consensus_translation": "影像杀死电台明星", "category": "歌曲", "alias": "", "group": "", "author": "Buggles", "album": "", "date": "1978", "language": "en", "wikipedia": {"pageid": 392424, "ns": 0, "title": "Video Killed the Radio Star", "extract": "\"Video Killed the Radio Star\" is a song written by Trevor Horn, Geoff Downes and Bruce Woolley in 1978. It was first recorded by Bruce Woolley and the Camera Club (with Thomas Dolby on keyboards) for their album English Garden, and later by British new wave/synth-pop group the Buggles, consisting of Horn and Downes. The track was recorded and mixed in 1979, released as their debut single on 7 September 1979 by Island Records, and included on their first album The Age of Plastic. The backing track was recorded at Virgin's Town House in West London, and mixing and vocal recording would later take place at Sarm East Studios.\nThe song relates to concerns about mixed attitudes towards 20th-century inventions and machines for the media arts. Musically, the song performs like an extended jingle and the composition plays in the key of D-flat major in common time at a tempo of 132 beats per minute. The track has been positively received, with reviewers praising its unusual musical pop elements. Although the song includes several common pop characteristics and six basic chords are used in its structure, Downes and writer Timothy Warner described the piece as musically complicated, due to its use of suspended and minor ninth chords for enhancement that gave the song a \"slightly different feel.\"\n\nOn release, the single topped sixteen international music charts, including those in the UK, Australia, and Japan. It also peaked in the top 10 in Canada, Germany, New Zealand and South Africa, but only reached number 40 in the US. The accompanying music video was written, directed, and edited by Russell Mulcahy. It was the first music video shown on MTV in the US, airing at 12:01 a.m. on 1 August 1981, and the first video shown on MTV Classic in the UK on 1 March 2010. The song has received several critical accolades, such as being ranked number 40 on VH1's 100 Greatest One-Hit Wonders of the '80s. It has also been covered by many recording artists. \n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "影像杀死电台明星", "details": ""}]}