{"id": "vijay prashad", "name": "Vijay Prashad", "consensus_translation": "维杰·普拉沙德", "category": "学者", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 13487535, "ns": 0, "title": "Vijay Prashad", "extract": "Vijay Prashad is an Indian historian, journalist, commentator and a Marxist intellectual. He is an executive-director of Tricontinental: Institute for Social Research and the Chief Editor of LeftWord Books.\nHe was the George and Martha Kellner Chair in South Asian History and a professor of International Studies at Trinity College in Hartford, Connecticut, United States from 1996 to 2017. In 2013–2014, he was the Edward Said Chair at the American University of Beirut and has been a Senior Fellow of the Issam Fares Institute for Public Policy and International Affairs in Beirut.\nPrashad is the author of thirty books. In 2012, he published five books, including Arab Spring, Libyan Winter (AK Press) and Uncle Swami: South Asians in America Today (The New Press). His book The Darker Nations: A People's History of the Third World (2007) was chosen as the Best Nonfiction book by the Asian American Writers' Workshop in 2008 and it won the Muzaffar Ahmed Book Award in 2009. In 2013, Verso published his The Poorer Nations: A Possible History of the Global South. He is author of No Free Left: The Futures of Indian Communism (LeftWord Books, 2015) and the editor of Letters to Palestine (Verso Books, 2015), a book that includes the writings of Teju Cole, Sinan Antoon, Noura Erakat, and Junot Diaz. His most recent book is Red Star Over the Third World (LeftWord, 2017).\nPrashad is a journalist, the Chief Correspondent for Globetrotter - a project of the Independent Media Institute. He is a columnist for Frontline and writes regularly for The Hindu and BirGun. He has reported from around the world for the Indian media - from Latin America to the Middle East to Africa.\nIn 2015, Prashad joined as the Chief Editor of the New Delhi-based publisher LeftWord Books. He is also an advisory board member of the US Campaign for the Academic and Cultural Boycott of Israel, part of the global BDS movement."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "维杰·普拉沙德", "details": ""}]}