{"id": "warren g", "name": "Warren G", "consensus_translation": "沃伦·G", "category": "乐人", "alias": "", "group": "", "author": "", "album": "", "date": "", "language": "en", "wikipedia": {"pageid": 161493, "ns": 0, "title": "Warren G", "extract": "Warren Griffin III (born November 10, 1970), or Warren G, is an American rapper and record producer who, aiding the G-funk sound, assisted West Coast rap's 1990s ascent. In 1990, he had formed with Nate Dogg and Snoop Dogg a trio, 213. Topping his seven Top 40 hits, the 1994 single \"Regulate,\" Warren's duet with Nate, was a massive hit. Earlier, despite his teenage jailings in his California hometown Long Beach, having pioneering gangsta rapper Dr. Dre for older stepbrother, and having standout lyricist Snoop for groupmate, Warren G took a unique path into the rap subgenre G-funk's success.Not joining them at Death Row Records, where he helped on their debut solo albums, Warren G signed to a Def Jam label. And less suggesting gangsta funk, yet voicing simpler concerns more simply, Warren G became G-funk's everyman. On the pop singles chart, the Billboard Hot 100, amid 18 weeks in the Top 40, \"Regulate\" held #2 for three weeks by August 1994, and led his debut album Regulate... G Funk Era. Certified 3x Multi-Platinum, three million copies, in August 1995, it also bears his other Top 10 hit, \"This D.J.,\" at #9. Both songs drew 1995 Grammy nominations as \"Do You See\" reached #42.His second or 1997 album, Take a Look Over Your Shoulder, includes three Top 40 pop, with \"I Shot the Sheriff\" at #20, but \"Smokin' Me Out,\" at #35, big locally. His sixth Top 40 pop, at #18, is Nate Dogg's 1998 single, a duet, \"Nobody Does It Better.\" Warren meanwhile began family life, and would increasingly value it. His 1999 album, I Want It All, charted the title track at #23 pop. Although swiftly certified Gold, half a million copies, both albums remain so over 20 years later, his final albums certified. In 2001, his fourth album, The Return of the Regulator, a comeback attempt with star collaborators, strayed from his strengths.On indie labels, 2005's In the Mid-Nite Hour and then 2009's The G Files, still a G-funk with, he said, \"a taste of that modern electro sound,\" are his own productions, but escaped popular notice. In the 2010s, amid his live shows, festival touring, and television appearances, his fan base, accessible via the digital age, asked for classic G-funk. In 2015, he released Regulate... G Funk Era, Pt. II, an EP with archived recordings of Nate Dogg, who died in 2011. By digital downloads, their \"Regulate\" single, Platinum since 1994, went 2x Multi-Platinum in 2017. In 2019, Warren G launched a line of barbecue sauces, Sniffin Griffins BBQ."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "沃伦·G", "details": ""}]}