{"id": "who shot ya?", "name": "Who Shot Ya?", "consensus_translation": "《谁对你开的枪？》", "category": "歌", "alias": "", "group": "", "author": "Notorious B.I.G.", "album": "", "date": 1994.0, "language": "en", "wikipedia": {"pageid": 7285375, "ns": 0, "title": "Who Shot Ya?", "extract": "\"Who Shot Ya?,\" or often, without the question mark, \"Who Shot Ya,\" is a song by gangsta rapper the Notorious B.I.G., commonly called Biggie Smalls, backed by Puff Daddy. It was released by Puffy's emerging record label, Bad Boy, on February 21, 1995, on the B side of an alternate reissue of Biggie's single \"Big Poppa/Warning,\" out since December 5, 1994. While the A side's \"Big Poppa\" was already a big pop hit, the reissue's closing track, \"Who Shot Ya?\"—with menacing lyrics delivered deftly—swiftly became a massive hit on the streets, and highly influential. Biggie's most infamous classic, it was also controversial. Despite never naming him, it started a \"rap battle\" with rapper Tupac.The \"Who Shot Ya?\" instrumental section, itself now historic in rap, was produced by Puffy and one of his staff record producers. Puffy had first used it for a brief, rap interlude on Uptown Records singer Mary J. Blige's R&B album My Life, released in late November 1994. The shared basis is a looping sample, a portion of David Porter's song \"The Masquerade is Over\" on his 1971 album Victim of the Joke. In late February 1995, the \"Who Shot Ya?\" lyrics sounded much like taunting of Tupac. In early February, Tupac had received a prison sentence, and in late November 1994 had been shot in a robbery by gunmen awaiting his arrival at a New York recording studio to record a verse for an Uptown Records rapper.Published in its April 1995 issue, Vibe magazine's January interview with Tupac publicized his suspicions that individuals at the record studio, including Biggie and Puffy, had aided the November 1994 attack. Interviewed in response, Biggie and Puffy denied roles in the attack, and Biggie called it \"crazy\" to say that \"Who Shot Ya?\" was about Tupac. Still, citing the release's timing, and refusing to \"hide behind the facts,\" Tupac created the answer song \"Hit 'Em Up,\" naming, taunting, and threatening Biggie and Puffy. Released in June 1996, another massive hit on the streets, it impelled rap's East–West rivalry to peak intensity. Questioned about its alleged provocation, Biggie reiterated that he had recorded \"Who Shot Ya?\" well before Tupac was shot.Tupac's fatal shooting in September 1996 and Biggie's in March 1997 remain officially unresolved over 20 years later, but triggered speculations partly blaming this \"rap battle.\" Later, some of Biggie's associates or proponents asserted that \"Who Shot Ya?\" or its lyrics had nothing to do with Tupac. Some of these assertions, more literally, reassert innocence in the November 1994 attack. In any case, \"Who Shot Ya?\" was reissued in 1999 on its rapper's posthumous album Born Again, in 2001 on a \"Big Poppa/Warning\" single reissue with remixes, in 2004 on the remastered edition of his 1994 or debut album Ready to Die, and in 2007 on his compilation album Greatest Hits. In 2016, rock band Living Colour released a cover version, whose music video protests gun violence. Meanwhile, the term Who Shot Ya? became a trope outside of music.\n\n"}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "《谁对你开的枪？》", "details": ""}]}