{"id": "千と千尋の神隠し", "name": "千と千尋の神隠し", "consensus_translation": "千与千寻", "category": "影视剧", "alias": "", "group": "", "author": "", "album": "", "date": "2001", "language": "en", "wikipedia": {"pageid": 70091, "ns": 0, "title": "Spirited Away", "extract": "Spirited Away (Japanese: 千と千尋の神隠し, Hepburn: Sen to Chihiro no Kamikakushi, \"Sen and Chihiro’s Spiriting Away\") is a 2001 Japanese animated fantasy film written and directed by Hayao Miyazaki, animated by Studio Ghibli for Tokuma Shoten, Nippon Television Network, Dentsu, Buena Vista Home Entertainment, Tohokushinsha Film and Mitsubishi, and distributed by Toho. The film stars Rumi Hiiragi, Miyu Irino, Mari Natsuki, Takeshi Naito, Yasuko Sawaguchi, Tsunehiko Kamijō, Takehiko Ono, and Bunta Sugawara. Spirited Away tells the story of Chihiro Ogino (Hiiragi), a 10-year-old girl who, while moving to a new neighbourhood, enters the world of Kami (spirits) of Japanese Shinto folklore. After her parents are turned into pigs by the witch Yubaba (Natsuki), Chihiro takes a job working in Yubaba's bathhouse to find a way to free herself and her parents and return to the human world.\nMiyazaki wrote the script after he decided the film would be based on the 10-year-old daughter of his friend Seiji Okuda, the movie's associate producer, who came to visit his house each summer. At the time, Miyazaki was developing two personal projects, but they were rejected. With a budget of 19 million US dollars, production of Spirited Away began in 2000. Pixar animator John Lasseter, a fan and friend of Miyazaki, convinced Walt Disney Pictures to buy the film's North American distribution rights and served as executive producer of its English-dubbed version. Lasseter then hired Kirk Wise as director and Donald W. Ernst as producer of the version while screenwriters Cindy Davis Hewitt and Donald H. Hewitt wrote the English-language dialogue in order to match the characters' original Japanese-language lip movements.The film was originally released in Japan on 20 July 2001 by distributor Toho. It became the most successful film in Japanese history, grossing over $347 million worldwide. The film overtook Titanic (the top-grossing film worldwide at the time) in the Japanese box office to become the highest-grossing film in Japanese history with a total of  ¥30.8 billion. Spirited Away received universal acclaim and is frequently ranked among the greatest animated films ever made. It won the Academy Award for Best Animated Feature at the 75th Academy Awards, making it the first (and, to date, only) hand-drawn and non-English-language animated film to win that award. It was the co-recipient of the Golden Bear at the 2002 Berlin International Film Festival (shared with Bloody Sunday) and is in the top 10 on the British Film Institute's list of \"Top 50 films for children up to the age of 14\".In 2016, it was voted the fourth-best film of the 21st century as picked by 177 film critics from around the world, making it the highest-ranking animated film on the list. It was also named the second \"Best Film of the 21st Century So Far\" in 2017 by The New York Times."}, "opinions": [{"user_name": "mimida", "github_handle": "idmimida", "translation": "千与千寻", "details": ""}]}